
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1-基准测试介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-OceanBase如何做TPCC测试.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    01-操作系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../01-操作系统/linux.html">
            
                <a href="../01-操作系统/linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../01-操作系统/windows.html">
            
                <a href="../01-操作系统/windows.html">
            
                    
                    windows
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    02-数据结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../02-数据结构/list.html">
            
                <a href="../02-数据结构/list.html">
            
                    
                    list
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    03-计算机网络
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../03-计算机网络/tcp.html">
            
                <a href="../03-计算机网络/tcp.html">
            
                    
                    tcp
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    04-tpcc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="1-基准测试介绍.html">
            
                <a href="1-基准测试介绍.html">
            
                    
                    1-基准测试介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="2-OceanBase如何做TPCC测试.html">
            
                <a href="2-OceanBase如何做TPCC测试.html">
            
                    
                    2-OceanBase如何做TPCC测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="3-基准测试之SQL优化.html">
            
                <a href="3-基准测试之SQL优化.html">
            
                    
                    3-基准测试之SQL优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="4-基准测试之事务引擎的挑战.html">
            
                <a href="4-基准测试之事务引擎的挑战.html">
            
                    
                    4-基准测试之事务引擎的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="5-基准测试之存储优化.html">
            
                <a href="5-基准测试之存储优化.html">
            
                    
                    5-基准测试之存储优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="6-基准测试之链路层优化.html">
            
                <a href="6-基准测试之链路层优化.html">
            
                    
                    6-基准测试之链路层优化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    05-misc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../misc/gitbook安装.html">
            
                <a href="../misc/gitbook安装.html">
            
                    
                    gitbook安装
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1-基准测试介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="1-&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4ECB;&#x7ECD;">1-&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4ECB;&#x7ECD;</h1>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x9633;&#x632F;&#x5764;    2019-10-06</p>
<p>&#x200B;
 &#x81EA;&#x4ECE;&#x8682;&#x8681;&#x91D1;&#x670D;&#x81EA;&#x7814;&#x6570;&#x636E;&#x5E93;OceanBase&#x83B7;&#x5F97;TPC-C&#x6D4B;&#x8BD5;&#x7B2C;&#x4E00;&#x540D;&#x540E;&#xFF0C;&#x5F15;&#x8D77;&#x4E86;&#x884C;&#x4E1A;&#x5185;&#x5916;&#x5927;&#x91CF;&#x5173;&#x6CE8;&#xFF0C;&#x6211;&#x4EEC;&#x8877;&#x5FC3;&#x7684;&#x611F;&#x8C22;&#x5927;&#x5BB6;&#x5BF9;OceanBase&#x7684;&#x652F;&#x6301;&#x4E0E;&#x539A;&#x7231;&#xFF0C;&#x4E5F;&#x865A;&#x5FC3;&#x542C;&#x53D6;&#x5916;&#x754C;&#x7684;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x6D4B;&#x8BD5;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x7279;&#x610F;&#x9080;&#x8BF7;&#x4E86;OceanBase&#x7684;&#x6838;&#x5FC3;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x672C;&#x6B21;&#x6D4B;&#x8BD5;&#x505A;&#x4E13;&#x4E1A;&#x7684;&#x6280;&#x672F;&#x89E3;&#x8BFB;&#xFF0C;&#x672C;&#x6587;&#x4E3A;&#x7B2C;&#x4E00;&#x7BC7;&#xFF0C;&#x540E;&#x7EED;&#x6587;&#x7AE0;&#x4E5F;&#x5C06;&#x4E8E;&#x8FD1;&#x65E5;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#x3002;</p>
<p> OceanBase&#x4E8E;2010&#x5E74;&#x7ACB;&#x9879;&#xFF0C;&#x4E5D;&#x5E74;&#x6765;&#xFF0C;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x6B65;&#x4E00;&#x4E2A;&#x811A;&#x5370;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x5BF9;OceanBase&#x505A;&#x51FA;&#x6539;&#x8FDB;&#x4EE5;&#x53CA;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x3002;OceanBase&#x4E5F;&#x4ECE;&#x670D;&#x52A1;&#x4E8E;&#x652F;&#x4ED8;&#x5B9D;&#x5F00;&#x59CB;&#xFF0C;&#x9010;&#x6E10;&#x5BF9;&#x5916;&#x5F00;&#x653E;&#xFF0C;&#x4E3A;&#x5E7F;&#x5927;&#x7684;&#x5404;&#x884C;&#x4E1A;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5916;&#x754C;&#x5BF9;OceanBase&#x7684;&#x5B9E;&#x529B;&#x6709;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x66F4;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;TPC-C&#x6D4B;&#x8BD5;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7EDD;&#x4F73;&#x7684;&#x821E;&#x53F0;&#x3002; </p>
<p>&#x901A;&#x8FC7;&#x672C;&#x6B21;&#x6D4B;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;OceanBase&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x589E;&#x52A0;CPU&#x3001;&#x5185;&#x5B58;&#x7B49;&#x6765;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;OceanBase&#x901A;&#x8FC7;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x5927;&#x91CF;&#x7684;&#x666E;&#x901A;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x50CF;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4E00;&#x6837;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x60F3;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x53EA;&#x9700;&#x589E;&#x52A0;&#x8BBE;&#x5907;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;OceanBase&#x5728;&#x6BCF;&#x53F0;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x6027;&#x80FD;&#x8FD8;&#x6709;&#x4E0D;&#x5C11;&#x63D0;&#x5347;&#x7A7A;&#x95F4;&#xFF1B;&#x53E6;&#x5916;&#xFF0C;OceanBase&#x652F;&#x6301;&#x7684;&#x529F;&#x80FD;&#x3001;&#x6613;&#x7528;&#x6027;&#x3001;&#x6570;&#x636E;&#x5E93;&#x751F;&#x6001;&#x76F8;&#x6BD4;&#x4E1A;&#x754C;&#x6807;&#x6746;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5DEE;&#x8DDD;&#x3002; </p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;OceanBase&#x5C06;&#x5728;&#x4E24;&#x4E2A;&#x91CD;&#x70B9;&#x65B9;&#x5411;&#x4E0A;&#x53D1;&#x529B;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x517C;&#x5BB9;Oracle&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x5404;&#x79CD;&#x529F;&#x80FD;&#xFF0C;&#x65B9;&#x4FBF;&#x5BA2;&#x6237;&#x5207;&#x6362;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x63D0;&#x5347;OLAP&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5206;&#x6790;&#x6316;&#x6398;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x7528;&#x540C;&#x4E00;&#x5957;&#x5F15;&#x64CE;&#x540C;&#x65F6;&#x652F;&#x6301;OLAP&#x4E0E;OLTP&#xFF0C;&#x5B8C;&#x5584;OceanBase&#x5728;&#x5927;&#x6570;&#x636E;&#x5904;&#x7406;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#x3002; &#x540E;&#x7EED;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x5F00;&#x6E90;&#x672C;&#x6B21;TPC-C&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x5E0C;&#x671B;&#x4E0E;&#x4E1A;&#x754C;&#x540C;&#x884C;&#x591A;&#x591A;&#x4EA4;&#x6D41;&#xFF0C;&#x5171;&#x540C;&#x63A2;&#x8BA8;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x4E0E;&#x672A;&#x6765;&#x3002; </p>
<p><strong>&#x6B63;&#x6587;</strong></p>
<p>&#x7F51;&#x7EDC;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x4ECB;&#x7ECD;TPC-C benchmark&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x800C;&#x4E14;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x8FD8;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x8FDB;&#x884C;&#x4E86;TPC-C&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD8;&#x83B7;&#x5F97;&#x4E86;&#x5355;&#x673A;&#x767E;&#x4E07;&#x7EA7;tpmC&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x5343;&#x4E07;&#x7EA7;tpmC&#x7B49;&#x7B49;&#x3002;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x7A76;&#x7ADF;&#x662F;&#x600E;&#x6837;&#x5462;&#xFF1F;</p>
<p> &#x5C31;&#x50CF;&#x5F88;&#x591A;&#x4EBA;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x56FD;&#x9645;&#x4E8B;&#x52A1;&#x6027;&#x80FD;&#x59D4;&#x5458;&#x4F1A;&#xFF08;TPC&#xFF09;&#x7EC4;&#x7EC7;&#x662F;&#x6570;&#x5341;&#x5BB6;&#x4F1A;&#x5458;&#x516C;&#x53F8;&#x521B;&#x5EFA;&#x7684;&#x975E;&#x76C8;&#x5229;&#x7EC4;&#x7EC7;&#xFF0C;TPC-C&#x662F;TPC&#x7EC4;&#x7EC7;&#x5236;&#x5B9A;&#x7684;&#x5173;&#x4E8E;&#x5546;&#x54C1;&#x9500;&#x552E;&#x7684;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x548C;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#x7B49;&#x7684;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;OLTP&#xFF09;&#x7684;&#x6743;&#x5A01;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x3002;TPC-C&#x6709;5&#x79CD;&#x4E8B;&#x52A1;&#xFF0C;&#x6BCF;&#x79CD;&#x4E8B;&#x52A1;&#x6709;&#x89C4;&#x5B9A;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x5206;&#x522B;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#x4E0D;&#x4F4E;&#x4E8E;43%&#xFF0C;&#x8BA2;&#x5355;&#x67E5;&#x8BE2;&#x3001;&#x8BA2;&#x5355;&#x53D1;&#x8D27;&#x548C;&#x5E93;&#x5B58;&#x67E5;&#x8BE2;&#x5404;&#x4E0D;&#x4F4E;&#x4E8E;4%&#xFF0C;&#x5176;&#x4F59;&#x5219;&#x4E3A;&#x8BA2;&#x5355;&#x521B;&#x5EFA;(&#x4E0D;&#x9AD8;&#x4E8E;45%)&#xFF0C;tpmC&#x503C;&#x662F;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x4E8B;&#x52A1;&#x6BCF;&#x5206;&#x949F;&#x6267;&#x884C;&#x7684;&#x6570;&#x91CF;&#x3002; </p>
<p>TPC-C benchmark&#x6D4B;&#x8BD5;&#x5FC5;&#x987B;&#x901A;&#x8FC7;TPC&#x7EC4;&#x7EC7;&#x7684;&#x5BA1;&#x8BA1;&#xFF08;&#x51C6;&#x786E;&#x5730;&#x8BB2;&#x662F;TPC-C&#x7EC4;&#x7EC7;&#x8BA4;&#x53EF;&#x7684;&#x5BA1;&#x8BA1;&#x5458;&#x7684;&#x5BA1;&#x8BA1;&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x5BA1;&#x8BA1;&#x7684;TPC-C&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5176;&#x5B8C;&#x6574;&#x8BE6;&#x5B9E;&#x7684;&#x6D4B;&#x8BD5;&#x62A5;&#x544A;&#xFF08;&#x5305;&#x62EC;&#x6D4B;&#x8BD5;&#x5382;&#x5BB6;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7248;&#x672C;&#x3001;&#x8BE6;&#x7EC6;&#x7684;&#x8F6F;&#x786C;&#x4EF6;&#x914D;&#x7F6E;&#x3001;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x7B49;&#xFF09;&#x5C06;&#x516C;&#x5E03;&#x5728;TPC&#x7EC4;&#x7EC7;&#x7684;&#x7F51;&#x7AD9;&#xFF08; www.tpc.org &#xFF09;&#x4E0A;&#x3002;&#x6CA1;&#x6709;&#x901A;&#x8FC7;TPC&#x7684;&#x5BA1;&#x8BA1;&#x800C;&#x64C5;&#x81EA;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x901A;&#x8FC7;&#x4E86;TPC-C&#x6D4B;&#x8BD5;&#x3001;&#x83B7;&#x5F97;XXX tpmC&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x4FB5;&#x6743;&#xFF0C;&#x4E5F;&#x662F;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#x3002;&#x9664;&#x4E86;OceanBase&#xFF0C;&#x76EE;&#x524D;&#x5728;TPC&#x7F51;&#x7AD9;&#x4E0A;&#x8FD8;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56FD;&#x4EA7;&#x6570;&#x636E;&#x5E93;&#x7684;TPC-C benchmark&#x7684;&#x6D4B;&#x8BD5;&#x62A5;&#x544A;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5B8C;&#x5168;&#x81EA;&#x4E3B;&#x7814;&#x53D1;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x5F00;&#x6E90;&#x57FA;&#x7840;&#x4E0A;&#x4FEE;&#x6539;&#x7684;&#x3002;</p>
<p> &#x4E3A;&#x4EC0;&#x4E48;TPC-C benchmark&#x6D4B;&#x8BD5;&#x5FC5;&#x987B;&#x8981;&#x901A;&#x8FC7;TPC&#x7EC4;&#x7EC7;&#x7684;&#x5BA1;&#x8BA1;&#x5462;&#xFF1F;&#x8FD9;&#x8FD8;&#x5F97;&#x4ECE;TPC&#x7EC4;&#x7EC7;&#x7684;&#x8BDE;&#x751F;&#x8BF4;&#x8D77;&#x3002;1980&#x5E74;&#x4EE3;&#x6570;&#x636E;&#x5E93;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x5373;OLTP&#xFF08;Online Transactional Processing&#xFF09;&#x51FA;&#x73B0;&#x540E;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x63A8;&#x52A8;&#x4E86;&#x8BF8;&#x5982;&#x81EA;&#x52A8;&#x63D0;&#x6B3E;&#x673A;&#xFF08;Automated teller transaction&#xFF0C;ATM&#xFF09;&#x7B49;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x90FD;&#x8BD5;&#x56FE;&#x5411;&#x5BA2;&#x6237;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6700;&#x597D;&#x3001;&#x5904;&#x7406;&#x80FD;&#x529B;&#x6700;&#x5F3A;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x8C01;&#x6765;&#x76D1;&#x7763;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x7684;&#x6267;&#x884C;&#x548C;&#x7ED3;&#x679C;&#x53D1;&#x5E03;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x5BA2;&#x6237;&#x65E0;&#x6CD5;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x5404;&#x81EA;&#x7684;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x4E5F;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8BF4;&#x670D;&#x529B;&#x3002; </p>
<p>1985&#x5E74;&#x521D;&#xFF0C;Jim Gray&#x8054;&#x5408;24&#x4F4D;&#x6765;&#x81EA;&#x5B66;&#x672F;&#x754C;&#x548C;&#x5DE5;&#x4E1A;&#x754C;&#x7684;&#x540C;&#x4EC1;&#x53D1;&#x8868;&#x4E86;&#x540D;&#x4E3A;&#x201C;A Measure of Transaction Processing Power&#x201D;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x5728;&#x7EBF;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;DebitCredit&#x3002;DebitCredit&#x5B9A;&#x4E49;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;benchmark&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x5F81;&#xFF08; <a href="http://www.tpc.org/information/about/history.asp" target="_blank">http://www.tpc.org/information/about/history.asp</a> &#xFF09;&#xFF1A;</p>
<ul>
<li>&#x5B9A;&#x4E49;&#x4E86;&#x88AB;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x8981;&#x6C42;&#x800C;&#x4E0D;&#x662F;&#x8F6F;&#x4EF6;&#x786C;&#x4EF6;&#x672C;&#x8EAB;</li>
<li>&#x89C4;&#x5B9A;&#x4E86;&#x88AB;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x6269;&#x5C55;&#x51C6;&#x5219;&#xFF0C;&#x5373;&#x6027;&#x80FD;&#x4E0E;&#x6570;&#x636E;&#x91CF;&#x76F8;&#x5339;&#x914D;</li>
<li>&#x89C4;&#x5B9A;&#x88AB;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#xFF08;&#x6BD4;&#x5982;95%&#x4E8B;&#x52A1;&#x5728;1s&#x5185;&#x5B8C;&#x6210;&#xFF09;</li>
<li>&#x628A;&#x88AB;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x6210;&#x672C;&#x7EB3;&#x5165;&#x6027;&#x80FD;benchmark</li>
</ul>
<p>DebitCredit&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x5EFA;&#x7ACB;&#x4E86;&#x7EDF;&#x4E00;&#x7684;&#x3001;&#x79D1;&#x5B66;&#x7684;&#x8861;&#x91CF;&#x6807;&#x51C6;&#xFF0C;&#x540E;&#x7EED;&#x76F8;&#x5173;&#x7684;benchmark&#x57FA;&#x672C;&#x90FD;&#x4EE5;&#x6B64;&#x4E3A;&#x57FA;&#x7840;&#x53D1;&#x5C55;&#x800C;&#x6765;&#x3002;&#x7136;&#x800C;&#x4E00;&#x4E9B;&#x5382;&#x5546;&#x5374;&#x5220;&#x6389;DebitCredit&#x6807;&#x51C6;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x8981;&#x6C42;&#x540E;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x4EE5;&#x4FBF;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x503C;&#xFF08;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x73B0;&#x5728;&#x4E5F;&#x88AB;&#x4E00;&#x4E9B;&#x56FD;&#x5185;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x7528;&#x5728;TPC-C benchmark&#x6D4B;&#x8BD5;&#x4E0A;&#xFF09;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x7684;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7EDF;&#x4E00;&#xFF1A;&#x5982;&#x679C;&#x8BF4;Jim Gray&#x7B49;&#x4EBA;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;benchmark&#x5236;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x6CD5;&#x5F8B;&#xFF08;DebitCredit&#xFF09;&#xFF0C;&#x4F46;&#x5374;&#x6CA1;&#x6709;&#x6267;&#x6CD5;&#x961F;&#x4F0D;&#x6765;&#x4FDD;&#x969C;&#x6CD5;&#x5F8B;&#x7684;&#x6267;&#x884C;&#x3002;1988&#x5E74;TPC&#x7EC4;&#x7EC7;&#x7684;&#x521B;&#x59CB;&#x4EBA;Omri Serlin&#xFF08; <a href="http://www.tpc.org/information/who/serlin.asp" target="_blank">http://www.tpc.org/information/who/serlin.asp</a> &#xFF09;&#x6210;&#x529F;&#x5730;&#x8BF4;&#x670D;8&#x5BB6;&#x516C;&#x53F8;&#x6210;&#x7ACB;&#x4E86;&#x975E;&#x76C8;&#x5229;&#x7684;TPC&#x7EC4;&#x7EC7;&#xFF0C;&#x7EDF;&#x4E00;&#x5236;&#x5B9A;&#x548C;&#x53D1;&#x5E03;benchmark&#x6807;&#x51C6;&#x5E76;&#x76D1;&#x7763;&#x548C;&#x5BA1;&#x8BA1;&#x6570;&#x636E;&#x5E93;benchmark&#x6D4B;&#x8BD5;&#xFF0C;&#x60C5;&#x51B5;&#x624D;&#x53D1;&#x751F;&#x4E86;&#x6839;&#x672C;&#x7684;&#x6539;&#x53D8;&#x3002; </p>
<p>&#x7ECF;&#x8FC7;&#x4E09;&#x5341;&#x591A;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;TPC&#x7EC4;&#x7EC7;&#x7684;&#x6210;&#x5458;&#x8D85;&#x8FC7;&#x4E86;20&#x4E2A;&#xFF0C;&#x8BDE;&#x751F;&#x548C;&#x5B8C;&#x5584;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x7684;&#x591A;&#x4E2A;benchmark&#x6807;&#x51C6;&#xFF0C;&#x5E76;&#x88AB;&#x5168;&#x4E16;&#x754C;&#x63A5;&#x53D7;&#x3002;&#x6BD4;&#x5982;TPC-C&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x662F;&#x5728;1992&#x5E74;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x4E4B;&#x540E;&#x7ECF;&#x5386;&#x4E86;&#x591A;&#x6B21;&#x4FEE;&#x8BA2;&#xFF0C;&#x4EE5;&#x9002;&#x5E94;&#x9700;&#x6C42;&#x548C;&#x6280;&#x672F;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5382;&#x5546;&#x6309;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x613F;&#x7BE1;&#x6539;TPC-C&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x6027;&#x80FD;&#x503C;&#xFF0C;TPC&#x7EC4;&#x7EC7;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;TPC&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x90FD;&#x8981;&#x7ECF;&#x8FC7;TPC&#x7EC4;&#x7EC7;&#x8BA4;&#x53EF;&#x7684;&#x5BA1;&#x8BA1;&#x5458;&#x7684;&#x5BA1;&#x8BA1;&#xFF0C;&#x5BA1;&#x8BA1;&#x5458;&#x5BF9;&#x6D4B;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x7684;&#x5BA1;&#x6838;&#xFF0C;&#x5BA1;&#x8BA1;&#x901A;&#x8FC7;&#x540E;&#xFF0C;&#x5BA1;&#x8BA1;&#x7ED3;&#x679C;&#x8FDE;&#x540C;&#x5B8C;&#x6574;&#x7684;&#x6D4B;&#x8BD5;&#x62A5;&#x544A;&#x63D0;&#x4EA4;&#x7ED9;TPC&#x7EC4;&#x7EC7;&#x7684;Technical Advisory Board&#xFF08;TAB&#xFF09;&#xFF0C;TAB&#x5BA1;&#x6838;&#x65E0;&#x5F02;&#x8BAE;&#x540E;&#x8FD8;&#x5C06;&#x8FDB;&#x884C;60&#x5929;&#x7684;&#x516C;&#x793A;&#xFF0C;&#x516C;&#x793A;&#x671F;&#x95F4;&#x5982;&#x6709;&#x5F02;&#x8BAE;&#x5382;&#x5546;&#x9700;&#x8981;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x6D4B;&#x8BD5;&#x7B26;&#x5408;&#x76F8;&#x5E94;&#x7684;TPC&#x6807;&#x51C6;&#xFF08;&#x5FC5;&#x8981;&#x65F6;&#x8FD8;&#x9700;&#x8981;&#x518D;&#x6B21;&#x8FD0;&#x884C;benchmark&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF09;&#x3002;</p>
<p> TPC-C&#x662F;&#x5BF9;&#x5546;&#x54C1;&#x9500;&#x552E;&#x652F;&#x4ED8;&#x7B49;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x5F88;&#x597D;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5728;&#x51C6;&#x5907;TPC-C&#x6D4B;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;OceanBase&#x8BB8;&#x591A;&#x6027;&#x80FD;&#x4E0D;&#x4F18;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5728;&#x5BF9;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#x548C;&#x5B8C;&#x5584;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;OceanBase&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;&#x4ECA;&#x5E74;&#xFF08;2019&#x5E74;&#xFF09;&#x53CC;11&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x76EE;&#x6807;&#xFF1A;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;TPC-C&#x4E94;&#x79CD;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5360;&#x6BD4;&#x6700;&#x9AD8;&#x7684;&#x4E24;&#x79CD;&#xFF0C;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#xFF08;new order&#xFF0C;&#x5360;&#x6BD4;45%&#xFF09;&#x548C;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#xFF08;payment&#xFF0C;&#x5360;&#x6BD4;43%&#xFF09;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x5BF9;&#x5E94;&#x4E86;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x548C;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#x3002;&#x56E0;&#x6B64;TPC-C&#x6A21;&#x578B;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6070;&#x6070;&#x662F;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5BF9;&#x5B9E;&#x9645;&#x7684;&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x505A;&#x4E86;&#x975E;&#x5E38;&#x597D;&#x7684;&#x62BD;&#x8C61;&#x3002;</p>
<p> &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x6807;&#x51C6;&#xFF0C;TPC-C&#x975E;&#x5E38;&#x4E25;&#x8C28;&#xFF0C;&#x6781;&#x5927;&#x5730;&#x675C;&#x7EDD;&#x4E86;&#x4F5C;&#x5F0A;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;OLTP&#x8054;&#x673A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x7684;benchmark&#xFF0C;TPC-C&#x8981;&#x6C42;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x7684;ACID&#xFF0C;&#x5373;&#x539F;&#x5B50;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x9694;&#x79BB;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#xFF0C;&#x5176;&#x4E2D;&#x9694;&#x79BB;&#x6027;&#x4E3A;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#x8981;&#x6C42;&#x80FD;&#x591F;&#x62B5;&#x5FA1;&#x4EFB;&#x4F55;&#x5355;&#x70B9;&#x6545;&#x969C;&#x7B49;&#x3002;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;OLTP&#x6570;&#x636E;&#x5E93;&#x7684;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;TPC-C&#x7684;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x4E8B;&#x52A1;&#xFF0C;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#xFF08;new order&#xFF09;&#x548C;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#xFF08;payment&#xFF09;&#xFF0C;&#x5206;&#x522B;&#x6709;10%&#x548C;15%&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF08;&#x6700;&#x591A;&#x53EF;&#x80FD;&#x5206;&#x5E03;&#x5728;15&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF09;&#xFF0C;&#x4E8B;&#x52A1;&#x7684;ACID&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5F88;&#x5927;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x81F3;&#x4ECA;&#x9C9C;&#x5C11;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x901A;&#x8FC7;TPC-C&#x6D4B;&#x8BD5;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x56FD;&#x5185;&#x6709;&#x4E9B;&#x5382;&#x5546;&#x6DF7;&#x6DC6;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x628A;&#x591A;&#x4E2A;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x5806;&#x5728;&#x4E00;&#x8D77;&#x800C;&#x53F7;&#x79F0;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5C3D;&#x7BA1;&#x6BCF;&#x4E2A;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x6EE1;&#x8DB3;ACID&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5806;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x591A;&#x4E2A;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x5E76;&#x4E0D;&#x6EE1;&#x8DB3;ACID&#x3002;</p>
<p> &#x5176;&#x6B21;&#xFF0C;TPC-C&#x89C4;&#x5B9A;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6027;&#x80FD;&#xFF08;tpmC&#xFF09;&#x4E0E;&#x6570;&#x636E;&#x91CF;&#x6210;&#x6B63;&#x6BD4;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x771F;&#x5B9E;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;TPC-C&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x5355;&#x5143;&#x662F;&#x4ED3;&#x5E93;&#xFF08;warehouse&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x6570;&#x636E;&#x91CF;&#x901A;&#x5E38;&#x5728;70MB&#x5DE6;&#x53F3;&#xFF08;&#x4E0E;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x76F8;&#x5173;&#xFF09;&#xFF0C;TPC-C&#x8981;&#x6C42;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x5728;&#x9009;&#x62E9;&#x4E8B;&#x52A1;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6309;&#x7167;&#x89C4;&#x5B9A;&#x7684;&#x6BD4;&#x4F8B;&#x9009;&#x62E9;&#x4E94;&#x79CD;&#x4E8B;&#x52A1;&#xFF0C;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x65F6;&#x95F4;&#xFF08;&#x5BF9;&#x6BCF;&#x79CD;&#x4E8B;&#x52A1;&#x5206;&#x522B;&#x56FA;&#x5B9A;&#xFF09;&#x548C;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x968F;&#x673A;&#x7684;&#x601D;&#x8003;&#x65F6;&#x95F4;&#xFF08;&#x4E00;&#x4E2A;&#x5BF9;&#x6570;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#xFF0C;&#x6BCF;&#x4E2A;&#x4ED3;&#x5E93;&#x6240;&#x80FD;&#x83B7;&#x5F97;&#x7684;tpmC&#x4E0A;&#x9650;&#x662F;12.86&#xFF08;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4E3A;0&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x67D0;&#x7CFB;&#x7EDF;&#x83B7;&#x5F97;150&#x4E07;tpmC&#xFF0C;&#x5927;&#x7EA6;&#x5BF9;&#x5E94;12&#x4E07;&#x4E2A;&#x4ED3;&#x5E93;&#xFF0C;&#x6309;70MB/&#x4ED3;&#x5E93;&#x8BA1;&#x7B97;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x7EA6;8.4TB&#xFF0C;&#x800C;TPC-C&#x540C;&#x65F6;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x5177;&#x5907;60&#x5929;&#x3001;&#x6BCF;&#x5929;&#x538B;&#x6D4B;8&#x5C0F;&#x65F6;&#x7684;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x53EF;&#x80FD;&#x8981;30TB&#x6216;&#x66F4;&#x591A;&#xFF0C;&#x800C;&#x67D0;&#x4E9B;&#x5382;&#x5546;&#x7528;&#x51E0;&#x767E;&#x6216;&#x51E0;&#x5343;&#x4E2A;&#x4ED3;&#x5E93;&#x5168;&#x90E8;&#x88C5;&#x5165;&#x5185;&#x5B58;&#xFF0C;&#x65E0;&#x89C6;&#x5355;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x6700;&#x5927;tpmC&#x4E0A;&#x9650;&#xFF0C;&#x7136;&#x540E;&#x53F7;&#x79F0;&#x83B7;&#x5F97;&#x767E;&#x4E07;tpmC&#xFF0C;&#x4E0D;&#x4EC5;&#x4E0D;&#x7B26;&#x5408;&#x5927;&#x591A;&#x6570;&#x771F;&#x5B9E;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;&#x800C;&#x4E14;&#x660E;&#x663E;&#x8FDD;&#x53CD;&#x4E86;TPC-C&#x89C4;&#x8303;&#xFF0C;&#x5C31;&#x50CF;&#x5F53;&#x5E74;TPC&#x7EC4;&#x7EC7;&#x6210;&#x7ACB;&#x4E4B;&#x524D;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x4E3A;&#x4E00;&#x6837;&#x3002;</p>
<p> &#x7B2C;&#x4E09;&#xFF0C;TPC-C&#x8981;&#x6C42;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x591F;&#x4EE5;&#x5E73;&#x7A33;&#x7684;&#x6027;&#x80FD;&#x957F;&#x671F;&#x5730;&#x8FD0;&#x884C;&#x3002;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x53BB;&#x6389;&#x542F;&#x52A8;&#x9884;&#x70ED;&#xFF08;ramp up&#xFF09;&#x548C;&#x7ED3;&#x675F;&#x964D;&#x901F;&#xFF08;ramp down&#xFF09;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x81F3;&#x5C11;&#x8981;&#x6027;&#x80FD;&#x5E73;&#x7A33;&#x5730;&#xFF08;steady state&#xFF09;&#x8FD0;&#x884C;8&#x5C0F;&#x65F6;&#xFF0C;&#x5176;&#x4E2D;&#x6027;&#x80FD;&#x91C7;&#x96C6;&#x65F6;&#x6BB5;&#xFF08;&#x4E0D;&#x5C11;&#x4E8E;2&#x5C0F;&#x65F6;&#xFF09;&#x5185;&#x7684;&#x6027;&#x80FD;&#x7D2F;&#x79EF;&#x6CE2;&#x52A8;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;2%&#x3002;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x5404;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5728;&#x6781;&#x9650;&#x538B;&#x529B;&#x4E0B;&#x6027;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x8F83;&#x5927;&#x7684;&#x6CE2;&#x52A8;&#x5E76;&#x53EF;&#x80FD;&#x88AB;&#x538B;&#x57AE;&#x800C;&#x5D29;&#x6E83;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x88AB;&#x538B;&#x57AE;&#xFF0C;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x8BA9;&#x7CFB;&#x7EDF;&#x5904;&#x4E8E;&#x6781;&#x9650;&#x538B;&#x529B;&#xFF0C;TPC-C&#x8FD9;&#x4E2A;&#x89C4;&#x5B9A;&#x6B63;&#x662F;&#x4ECE;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x9700;&#x6C42;&#x51FA;&#x53D1;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;TPC-C&#x8981;&#x6C42;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x7684;&#x8981;&#x6C42;&#x3002;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x8BA9;&#x6570;&#x636E;&#x5E93;&#x5728;&#x5F88;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x51B2;&#x51FB;&#x6027;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x5C16;&#x5CF0;&#x503C;&#xFF0C;&#x65E2;&#x6CA1;&#x6709;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5E93;&#x5728;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x5185;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#xFF0C;&#x66F4;&#x8C08;&#x4E0D;&#x4E0A;&#x6027;&#x80FD;&#x6CE2;&#x52A8;&#x4E0D;&#x8D85;&#x8FC7;2%&#xFF0C;&#x4F46;&#x5374;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FBE;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x5C16;&#x5CF0;&#x6027;&#x80FD;&#x3002;&#x672C;&#x6B21;benchmark&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;OceanBase&#x505A;&#x5230;&#x4E86;8&#x5C0F;&#x65F6;&#x6027;&#x80FD;&#x6CE2;&#x52A8;&#x4F4E;&#x4E8E;0.5%&#x3002; </p>
<p>&#x7B2C;&#x56DB;&#xFF0C;TPC-C&#x8981;&#x6C42;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5199;&#x4E8B;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x6570;&#x636E;&#x843D;&#x76D8;&#xFF08;&#x6307;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x662F;&#x65E5;&#x5FD7;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;redo log&#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x524D;&#x5C31;&#x843D;&#x76D8;&#x4E86;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x5177;&#x5907;checkpoint&#x529F;&#x80FD;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;checkpoint&#x7684;&#x95F4;&#x9694;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;30&#x5206;&#x949F;&#xFF0C;checkpoint&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;checkpoint&#x95F4;&#x9694;&#x3002;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5728;&#x6389;&#x7535;&#x7B49;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x6709;&#x8F83;&#x77ED;&#x7684;&#x6545;&#x969C;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x3002;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x6570;&#x636E;&#x5757;(&#x4F8B;&#x5982;4KB/8KB&#x7684;page/block)&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x505A;&#x5230;&#x8FD9;&#x4E2A;&#x662F;&#x628A;&#x810F;&#x9875;&#x5237;&#x76D8;&#x3002;&#x4F46;OceanBase&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x7B2C;&#x4E00;OceanBase&#x662F;&#x591A;&#x526F;&#x672C;&#xFF08;&#x672C;&#x6B21;&#x6D4B;&#x8BD5;&#x662F;3&#x526F;&#x672C;&#xFF09;&#x7684;&#x8DE8;&#x673A;&#x5668;&#x90E8;&#x7F72;&#xFF0C;&#x5355;&#x673A;&#x5668;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x80FD;&#x591F;&#x7ACB;&#x5373;&#x6062;&#x590D;&#xFF08;RTO=30s&#xFF09;&#x4E14;&#x6570;&#x636E;&#x65E0;&#x635F;&#xFF08;RPO=0&#xFF09;&#xFF0C;&#x5E76;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5199;&#x4E8B;&#x52A1;&#x7684;&#x6570;&#x636E;&#x843D;&#x76D8;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;OceanBase&#x662F;&#x201C;&#x57FA;&#x7EBF;&#x6570;&#x636E;&#x5728;&#x786C;&#x76D8;+&#x4FEE;&#x6539;&#x589E;&#x91CF;&#x6570;&#x636E;&#x5728;&#x5185;&#x5B58;&#x201D;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0A;&#x662F;&#x4FEE;&#x6539;&#x589E;&#x91CF;&#x6570;&#x636E;&#x4E00;&#x5929;&#x843D;&#x76D8;&#x4E00;&#x6B21;&#xFF08;&#x5373;&#x6BCF;&#x65E5;&#x5408;&#x5E76;&#xFF0C;&#x53EF;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x800C;&#x81EA;&#x52A8;&#x589E;&#x52A0;&#x6BCF;&#x65E5;&#x5408;&#x5E76;&#x6B21;&#x6570;&#xFF09;&#xFF0C;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E0D;&#x9700;&#x8981;&#x4E5F;&#x4E0D;&#x4F9D;&#x8D56;&#x6570;&#x636E;&#x5728;&#x8F83;&#x77ED;&#x65F6;&#x95F4;&#xFF08;&#x6BD4;&#x5982;30&#x5206;&#x949F;&#xFF09;&#x5185;&#x843D;&#x76D8;&#x3002;&#x5728;TPC-C benchmark&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;OceanBase&#x8BBE;&#x7F6E;&#x4E86;checkpointing&#xFF0C;&#x4FDD;&#x8BC1;&#x6240;&#x6709;checkpoint&#x7684;&#x95F4;&#x9694;&#x5C0F;&#x4E8E;30&#x5206;&#x949F;&#xFF0C;&#x5E76;&#x4F7F;&#x5F97;checkpoint&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;checkpoint&#x95F4;&#x9694;&#xFF0C;&#x4EE5;&#x7B26;&#x5408;TPC-C&#x89C4;&#x8303;&#x3002;</p>
<p> &#x7B2C;&#x4E94;&#xFF0C;&#x4E1A;&#x52A1;&#x5B9A;&#x5411;&#x4F18;&#x5316;&#xFF08;profile-directed optimization&#xFF0C;PDO&#xFF09;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x8F6F;&#x4EF6;&#x7684;&#x6027;&#x80FD;&#xFF0C;TPC-C&#x4E5F;&#x5141;&#x8BB8;&#x4F7F;&#x7528;PDO&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x91C7;&#x7528;PDO&#x4F18;&#x5316;&#x7684;&#x7248;&#x672C;&#x9700;&#x8981;&#x5728;&#x5BA2;&#x6237;&#x4F7F;&#x7528;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5BB6;&#x9700;&#x8981;&#x5BF9;PDO&#x4F18;&#x5316;&#x7684;&#x7248;&#x672C;&#x63D0;&#x4F9B;&#x6280;&#x672F;&#x652F;&#x6301;&#x7B49;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5F02;&#x8BAE;&#xFF0C;OceanBase&#x6CA1;&#x6709;&#x4F7F;&#x7528;PDO&#x3002;</p>
<p> &#x6700;&#x540E;&#xFF0C;TPC-C&#x89C4;&#x8303;&#x867D;&#x7136;&#x5341;&#x5206;&#x4E25;&#x683C;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x9F13;&#x52B1;&#x65B0;&#x6280;&#x672F;&#x548C;&#x65B0;&#x65B9;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x672C;&#x6B21;OceanBase&#x7684;TPC-C benchmark&#x6D4B;&#x8BD5;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x50CF;&#x4E4B;&#x524D;&#x7684;TPC-C benchmark&#x4E00;&#x6837;&#x8D2D;&#x4E70;&#x7269;&#x7406;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5B58;&#x50A8;&#xFF0C;&#x800C;&#x662F;&#x79DF;&#x7528;&#x4E86;&#x963F;&#x91CC;&#x4E91;&#x516C;&#x6709;&#x4E91;&#x7684;ECS&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x4F7F;&#x5F97;&#x6269;&#x5BB9;/&#x7F29;&#x5BB9;&#x8F7B;&#x800C;&#x6613;&#x4E3E;&#xFF0C;&#x8FD8;&#x53EF;&#x6309;&#x9700;&#x79DF;&#x8D41;&#x800C;&#x6781;&#x5927;&#x964D;&#x4F4E;&#x5B9E;&#x9645;&#x6D4B;&#x8BD5;&#x6210;&#x672C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="2-OceanBase如何做TPCC测试.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 2-OceanBase如何做TPCC测试">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1-基准测试介绍","level":"1.5.1","depth":2,"next":{"title":"2-OceanBase如何做TPCC测试","level":"1.5.2","depth":2,"path":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","ref":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","articles":[]},"previous":{"title":"04-tpcc","level":"1.5","depth":1,"ref":"","articles":[{"title":"1-基准测试介绍","level":"1.5.1","depth":2,"path":"src/04-tpcc/1-基准测试介绍.md","ref":"src/04-tpcc/1-基准测试介绍.md","articles":[]},{"title":"2-OceanBase如何做TPCC测试","level":"1.5.2","depth":2,"path":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","ref":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","articles":[]},{"title":"3-基准测试之SQL优化","level":"1.5.3","depth":2,"path":"src/04-tpcc/3-基准测试之SQL优化.md","ref":"src/04-tpcc/3-基准测试之SQL优化.md","articles":[]},{"title":"4-基准测试之事务引擎的挑战","level":"1.5.4","depth":2,"path":"src/04-tpcc/4-基准测试之事务引擎的挑战.md","ref":"src/04-tpcc/4-基准测试之事务引擎的挑战.md","articles":[]},{"title":"5-基准测试之存储优化","level":"1.5.5","depth":2,"path":"src/04-tpcc/5-基准测试之存储优化.md","ref":"src/04-tpcc/5-基准测试之存储优化.md","articles":[]},{"title":"6-基准测试之链路层优化","level":"1.5.6","depth":2,"path":"src/04-tpcc/6-基准测试之链路层优化.md","ref":"src/04-tpcc/6-基准测试之链路层优化.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/04-tpcc/1-基准测试介绍.md","mtime":"2022-11-26T05:32:05.726Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-11-26T05:32:25.530Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

