
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2-OceanBase如何做TPCC测试 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3-基准测试之SQL优化.html" />
    
    
    <link rel="prev" href="1-基准测试介绍.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    01-操作系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../01-操作系统/linux.html">
            
                <a href="../01-操作系统/linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../01-操作系统/windows.html">
            
                <a href="../01-操作系统/windows.html">
            
                    
                    windows
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    02-数据结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../02-数据结构/list.html">
            
                <a href="../02-数据结构/list.html">
            
                    
                    list
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    03-计算机网络
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../03-计算机网络/tcp.html">
            
                <a href="../03-计算机网络/tcp.html">
            
                    
                    tcp
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    04-数据库
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" >
            
                <span>
            
                    
                    mysql
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    spider
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" >
            
                <span>
            
                    
                    tpcc-ob记录
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.3.1" data-path="1-基准测试介绍.html">
            
                <a href="1-基准测试介绍.html">
            
                    
                    1-基准测试介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.3.2" data-path="2-OceanBase如何做TPCC测试.html">
            
                <a href="2-OceanBase如何做TPCC测试.html">
            
                    
                    2-OceanBase如何做TPCC测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3.3" data-path="3-基准测试之SQL优化.html">
            
                <a href="3-基准测试之SQL优化.html">
            
                    
                    3-基准测试之SQL优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3.4" data-path="4-基准测试之事务引擎的挑战.html">
            
                <a href="4-基准测试之事务引擎的挑战.html">
            
                    
                    4-基准测试之事务引擎的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3.5" data-path="5-基准测试之存储优化.html">
            
                <a href="5-基准测试之存储优化.html">
            
                    
                    5-基准测试之存储优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3.6" data-path="6-基准测试之链路层优化.html">
            
                <a href="6-基准测试之链路层优化.html">
            
                    
                    6-基准测试之链路层优化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    05-misc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../misc/gitbook安装.html">
            
                <a href="../misc/gitbook安装.html">
            
                    
                    gitbook安装
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    06-c++
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="../cpp/c++11新特性.html">
            
                <a href="../cpp/c++11新特性.html">
            
                    
                    c++11新特性
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    06-微服务
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" >
            
                <span>
            
                    
                    brpc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1.1" data-path="../microserver/bthread.html">
            
                <a href="../microserver/bthread.html">
            
                    
                    bthread
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.1.2" data-path="../microserver/bthread.html">
            
                <a href="../microserver/bthread.html">
            
                    
                    resourcepool
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2-OceanBase如何做TPCC测试</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-oceanbase&#x5982;&#x4F55;&#x505A;tpcc&#x6D4B;&#x8BD5;">2-OceanBase&#x5982;&#x4F55;&#x505A;TPCC&#x6D4B;&#x8BD5;</h1>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x66F9;&#x6656; 2019 &#x5E74; 10 &#x6708; 21 &#x65E5;</p>
<p>&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;TPC &#x7EC4;&#x7EC7;&#x662F;&#x5F53;&#x4ECA;&#x56FD;&#x9645;&#x6570;&#x636E;&#x5E93;&#x9886;&#x57DF;&#x516C;&#x8BA4;&#x6700;&#x6743;&#x5A01;&#x7684;&#x6D4B;&#x8BD5;&#x548C;&#x8BC4;&#x4EF7;&#x7EC4;&#x7EC7;&#xFF0C;&#x5B83;&#x6210;&#x7ACB;&#x7684;&#x521D;&#x8877;&#x5C31;&#x662F;&#x6784;&#x5EFA;&#x6700;&#x597D;&#x7684;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x4EE5;&#x53CA;&#x5236;&#x5B9A;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x6700;&#x4F18;&#x7684;&#x5BA1;&#x8BA1;&#x548C;&#x76D1;&#x6D4B;&#x6D41;&#x7A0B;&#x3002;&#x6570;&#x636E;&#x5E93;&#x754C;&#x7684;&#x5929;&#x7687;&#x5DE8;&#x661F; Jim Gray &#x66FE;&#x5728; 1985 &#x5E74;&#x63D0;&#x51FA;&#x4E86;&#x9488;&#x5BF9;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6; DebitCredit&#xFF0C;&#x800C; 1988 &#x5E74; TPC &#x7EC4;&#x7EC7;&#x6210;&#x7ACB;&#x4F0A;&#x59CB;&#xFF0C;&#x5C31;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x63D0;&#x51FA;&#x4E86; TPC &#x7EC4;&#x7EC7;&#x7B2C;&#x4E00;&#x4E2A;&#x9488;&#x5BF9; OLTP &#x5E94;&#x7528;&#x7684;&#x6D4B;&#x8BD5;&#x6807;&#x51C6; TPC-A&#x3002;&#x4F46;&#x968F;&#x7740;&#x65F6;&#x4EE3;&#x53D1;&#x5C55;&#xFF0C;TPC-A &#x5DF2;&#x7ECF;&#x6162;&#x6162;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x4F53;&#x73B0;&#x771F;&#x5B9E;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x6B64;&#x65F6; TPC-C &#x80A9;&#x8D1F;&#x91CD;&#x4EFB;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4E5F;&#x4E00;&#x76F4;&#x662F; TPC &#x7EC4;&#x7EC7;&#x6700;&#x6838;&#x5FC3;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x9886;&#x57DF;&#x6700;&#x9876;&#x7EA7;&#x7684;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x3002;TPC-C &#x6807;&#x51C6;&#x6BD4; TPC-A &#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x538B;&#x529B;&#x8D1F;&#x8F7D;&#x6A21;&#x578B;&#x662F; 16 &#x4F4D;&#x4E00;&#x7EBF;&#x5DE5;&#x4E1A;&#x4EA7;&#x4E1A;&#x754C;&#x5B66;&#x8005;&#x4E00;&#x8D77;&#x53C2;&#x4E0E;&#x5236;&#x5B9A;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x4E5F;&#x4E00;&#x76F4;&#x5728;&#x4FDD;&#x6301;&#x4FEE;&#x8BA2;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x6A21;&#x62DF;&#x5927;&#x578B;&#x5728;&#x7EBF;&#x5546;&#x8D85;&#x7684;&#x6D4B;&#x8BD5;&#x6A21;&#x578B;&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#x4E5F;&#x4ECD;&#x4E0D;&#x8FC7;&#x65F6;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x80FD;&#x627E;&#x5230;&#x548C;&#x5F53;&#x524D;&#x5927;&#x578B; B2C &#x7535;&#x5546;&#x7F51;&#x7AD9;&#x7684;&#x5171;&#x901A;&#x4E4B;&#x5904;&#x3002;</p>
<p>&#x6709;&#x673A;&#x4F1A;&#x6311;&#x6218; TPC-C &#x6D4B;&#x8BD5;&#x76F8;&#x4FE1;&#x662F;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5185;&#x6838;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x4F46; TPC-C &#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;1992 &#x5E74; 7 &#x6708;&#x53D1;&#x5E03;&#x4EE5;&#x6765;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x662F; v5.11.0 &#x7248;&#x672C;&#xFF0C;&#x4EC5; PDF &#x5C31; 132 &#x9875;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x94C1;&#x6746;&#x7C89;&#x4E1D;&#x4F30;&#x8BA1;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x4F1A;&#x8BA4;&#x771F;&#x901A;&#x8BFB;&#x5B8C;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x3002;&#x8FD9;&#x6B21; OceanBase &#x521B;&#x9020; TPC-C &#x8BB0;&#x5F55;&#x5F15;&#x8D77;&#x4E86;&#x5927;&#x5BB6;&#x7684;&#x5E7F;&#x6CDB;&#x5173;&#x6CE8;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x53EA;&#x662F;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x91CC;&#x4F53;&#x73B0;&#x8DD1;&#x5206;&#x7684;&#x4E00;&#x4E2A;&#x8BC4;&#x4EF7;&#x9879; MQTh(&#x6700;&#x5927;&#x6709;&#x6548;&#x541E;&#x5410;&#x91CF;)&#xFF0C;&#x9690;&#x85CF;&#x5728;&#x8DD1;&#x5206;&#x4E0B;&#x9762;&#x7684;&#x662F; TPC-C &#x6807;&#x51C6;&#x5BF9;&#x88AB;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x6570;&#x7EC6;&#x81F4;&#x5165;&#x5FAE;&#x7684;&#x6D4B;&#x8BD5;&#x9A8C;&#x8BC1;&#x548C;&#x8BC4;&#x4EF7;&#x9879;&#xFF0C;&#x800C;&#x6B63;&#x662F;&#x8FD9;&#x4E9B;&#x624D;&#x8BA9;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x9886;&#x57DF;&#x5982;&#x6B64;&#x6743;&#x5A01;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x56FD;&#x4EA7;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x524D;&#x5F88;&#x96BE;&#x5165;&#x573A;&#x7684;&#x4E00;&#x5927;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x662F;&#x56FD;&#x4EA7;&#x6570;&#x636E;&#x5E93;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7B2C;&#x4E00;&#x6B21;&#x51B2;&#x51FB;&#x8FD9;&#x4E2A;&#x699C;&#x5355;&#xFF0C;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x8FD9;&#x6B21;&#x6311;&#x6218;&#xFF0C;OceanBase &#x56E2;&#x961F;&#x524D;&#x540E;&#x51C6;&#x5907;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;&#x4E00;&#x5E74;&#xFF0C;&#x4EC5;&#x5BA1;&#x8BA1;&#x8BA4;&#x8BC1;&#x8FC7;&#x7A0B;&#x5C31;&#x8017;&#x65F6;&#x7EA6;&#x534A;&#x5E74;&#xFF0C;&#x9664;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x81EA;&#x8EAB;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x5408;&#x89C4;&#x8981;&#x6C42;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#xFF0C;6088w tpmC &#x5176;&#x5B9E;&#x4E5F;&#x53EA;&#x662F;&#x6574;&#x4E2A;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x4E2D;&#x4E00;&#x5C0F;&#x4E2A;&#x5C55;&#x793A;&#x9879;&#x800C;&#x5DF2;&#x3002;</p>
<h2 id="&#x524D;&#x671F;&#x51C6;&#x5907;">&#x524D;&#x671F;&#x51C6;&#x5907;</h2>
<p>&#x4F5C;&#x4E3A;&#x57FA;&#x4E8E; LSM-Tree&#x3001;&#x591A;&#x526F;&#x672C; paxos &#x5F3A;&#x4E00;&#x81F4;&#x7684;&#x65B0;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;&#x4F55;&#x8FDB;&#x884C; TPC-C &#x6D4B;&#x8BD5;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x6B65;&#x9AA4;&#x7B49;&#x7B49;&#x8BF8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x5BA1;&#x8BA1;&#x521A;&#x542F;&#x52A8;&#x65F6;&#x6211;&#x4EEC;&#x65E0;&#x5904;&#x54A8;&#x8BE2;&#x4E5F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53EF;&#x501F;&#x9274;&#x7684;&#x8D44;&#x6599;&#x3002;TPC-C &#x6D4B;&#x8BD5;&#x9996;&#x5148;&#x9700;&#x8981;&#x627E;&#x5230;&#x5B98;&#x65B9;&#x552F;&#x4E00;&#x8BA4;&#x8BC1;&#x7684;&#x5BA1;&#x8BA1;&#x5458;&#x6765;&#x5BF9;&#x6D4B;&#x8BD5;&#x8FDB;&#x884C;&#x5BA1;&#x8BA1;&#x76D1;&#x5BDF;&#xFF0C;&#x4F46;&#x9762;&#x5BF9; OceanBase &#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x67B6;&#x6784;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5176;&#x5B9E;&#x4E5F;&#x6709;&#x7740;&#x8BF8;&#x591A;&#x548C;&#x6211;&#x4EEC;&#x7C7B;&#x4F3C;&#x7684;&#x7591;&#x60D1;&#x548C;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x5BF9;&#x8FD9;&#x6B21; OceanBase &#x7684;&#x5BA1;&#x8BA1;&#x4E5F;&#x76F8;&#x5F53;&#x91CD;&#x89C6;&#xFF0C;&#x5168;&#x4E16;&#x754C;&#x4EC5;&#x6709;&#x7684;&#x4E09;&#x4E2A;&#x5BA1;&#x8BA1;&#x5458;&#x8FD9;&#x6B21;&#x5C31;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x4E0E;&#x5230;&#x6D4B;&#x8BD5;&#x5BA1;&#x8BA1;&#x5DE5;&#x4F5C;&#x4E2D;&#x3002;</p>
<p>&#x4E24;&#x4F4D;&#x5BA1;&#x8BA1;&#x5458;&#x5176;&#x4E2D;&#x4E00;&#x4F4D;&#x8FD8;&#x662F; TPC-C &#x6807;&#x51C6;&#x539F;&#x4F5C;&#x8005;&#x4E4B;&#x4E00;,&#x4ED6;&#x4EEC;&#x5BF9;&#x6574;&#x4E2A;&#x6D4B;&#x8BD5;&#x6D41;&#x7A0B;&#x7684;&#x8981;&#x6C42;&#x5F02;&#x5E38;&#x7EC6;&#x81F4;&#x548C;&#x4E25;&#x82DB;&#xFF0C;&#x8D77;&#x521D;&#x5BF9;&#x5F85; OceanBase &#x8FD8;&#x6301;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6000;&#x7591;&#x6001;&#x5EA6;&#xFF0C;&#x548C;&#x5BA1;&#x8BA1;&#x5458;&#x4EEC;&#x6F2B;&#x957F;&#x7684;&#x90AE;&#x4EF6;&#x4EE5;&#x53CA;&#x73B0;&#x573A;&#x6C9F;&#x901A;&#x8FC7;&#x7A0B;&#x4E5F;&#x5F02;&#x5E38;&#x8270;&#x8F9B;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x59CB;&#x7EC8;&#x575A;&#x6301;&#x7528;&#x89C4;&#x8303;&#x4E2D;&#x6700;&#x4E25;&#x683C;&#x7684;&#x6807;&#x51C6;&#x6765;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x6D4B;&#x8BD5;&#x5B50;&#x9879;&#xFF0C;&#x6700;&#x7EC8;&#x4E5F;&#x8D62;&#x5F97;&#x4E86;&#x5BA1;&#x8BA1;&#x5458;&#x4EEC;&#x5145;&#x5206;&#x7684;&#x4FE1;&#x4EFB;&#xFF0C;&#x5BA1;&#x8BA1;&#x5458;&#x751A;&#x81F3;&#x5728;&#x7406;&#x89E3;&#x4E86; OceanBase &#x67B6;&#x6784;&#x540E;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x591A;&#x4E2A;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#x3002;&#x53E6;&#x5916;&#x901A;&#x8FC7;&#x8FD9;&#x6B21;&#x6D4B;&#x8BD5;&#xFF0C;OceanBase &#x4E5F;&#x7ED9; TPC-C &#x6807;&#x51C6;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x9C9C;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x3002;</p>
<ul>
<li>&#x5982;&#x4F55;&#x5728; OceanBase &#x7279;&#x6709;&#x7684; Incremental &#x6570;&#x636E;&#x5E26;&#x4E0A;&#x540E;&#x7EED;&#x7684; Major Compaction &#x673A;&#x5236;&#x4E0B;&#x53BB;&#x505A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x5BA1;&#x8BA1;&#xFF1B;</li>
<li>&#x5982;&#x4F55;&#x5728;&#x5168;&#x90E8;&#x4F7F;&#x7528;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FDB;&#x884C; Durability &#x6D4B;&#x8BD5;&#xFF1B;</li>
<li>&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x5728;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x7B49;&#x6D4B;&#x8BD5;&#x4E2D;&#x5E94;&#x5F53;&#x5982;&#x4F55;&#x53BB;&#x8BC4;&#x4F30;&#x548C;&#x76D1;&#x63A7; checkpoint&#xFF1B;<h2 id="&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;">&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;</h2>
&#x76EE;&#x524D;&#x5E02;&#x9762;&#x4E0A;&#x57FA;&#x672C;&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x5F00;&#x7BB1;&#x5373;&#x7528;&#x7684;&#x7B26;&#x5408; TPC-C &#x6807;&#x51C6;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x3002;&#x4EE5;&#x76EE;&#x524D;&#x5404;&#x4E2A;&#x5382;&#x5546; PoC &#x73AF;&#x5883;&#x6700;&#x5E38;&#x9047;&#x5230;&#x7684; benchmarksql &#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x53EA;&#x662F;&#x6A21;&#x62DF; TPC-C &#x538B;&#x529B;&#x6A21;&#x578B;&#x7684;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#xFF0C;&#x8FDE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5BFC;&#x5165;&#x90FD;&#x4E0D;&#x5408;&#x89C4;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x751F;&#x6210;&#x672A;&#x4FDD;&#x8BC1;&#x5168;&#x5C40;&#x968F;&#x673A;&#xFF0C;&#x7F3A;&#x4E4F;&#x538B;&#x6D4B;&#x9636;&#x6BB5;&#x6700;&#x57FA;&#x672C;&#x7684; think time&#x3001;keying time &#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x914D;&#x7F6E;&#x5BFC;&#x81F4;&#x6781;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5C31;&#x80FD;&#x8DD1;&#x51FA;&#x5F88;&#x9AD8;&#x7684; tpmC&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x5B83;&#x5C06;&#x6D4B;&#x8BD5;&#x6A21;&#x578B;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E3A;&#x5DE5;&#x5177;&#x76F4;&#x8FDE; DB &#x6D4B;&#x8BD5;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x9075;&#x5B88; TPC-C &#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x89C4;&#x8303;&#x3002;</li>
</ul>
<p>&#x5728;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5206;&#x4E3A; RTE&#xFF08;Remote Terminal Emulator&#xFF09;&#x548C; SUT &#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4ECE;&#x89D2;&#x8272;&#x4E0A;&#x770B; SUT &#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x62C6;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;WAS(web application server)&#x548C; DB Server&#x3002;&#x8FD9;&#x5176;&#x4E2D; DB Server &#x662F;&#x6BCF;&#x4E2A;&#x6D4B;&#x8BD5;&#x5382;&#x5546;&#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF1B;RTE &#x626E;&#x6F14;&#x7684;&#x89D2;&#x8272;&#x662F;&#x6D4B;&#x8BD5;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5BA2;&#x6237;&#x7EC8;&#x7AEF;&#xFF0C;&#x4E8B;&#x52A1;&#x7684;&#x89E6;&#x53D1;&#x3001;RT &#x7684;&#x7EDF;&#x8BA1;&#x7B49;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5B8C;&#x6210;&#xFF1B;&#x6807;&#x51C6;&#x660E;&#x786E;&#x8981;&#x6C42;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x6237; terminal &#x90FD;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x957F;&#x8FDE;&#x63A5;&#xFF0C;&#x663E;&#x7136;&#x5728;&#x6D77;&#x91CF; Warehouse &#x65F6; DB &#x662F;&#x65E0;&#x6CD5;&#x627F;&#x53D7;&#x8FD9;&#x4E48;&#x591A;&#x8FDE;&#x63A5;&#x7684;&#xFF0C;WAS &#x5C31;&#x662F; RTE &#x548C; DB &#x4E4B;&#x95F4;&#x6865;&#x6881;&#xFF0C;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FDE;&#x63A5;&#x6C60;&#xFF0C;&#x5728;&#x4FDD;&#x8BC1;&#x5BF9;&#x5E94;&#x7528;&#x900F;&#x660E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x53EF;&#x4EE5;&#x505A;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x7684;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x4E2A;&#x89D2;&#x8272;&#x4E2D;&#xFF0C;WAS &#x548C; DB &#x662F;&#x5FC5;&#x987B;&#x5546;&#x4E1A;&#x5316;&#x53EF;&#x8D2D;&#x4E70;&#x4E14;&#x63D0;&#x4F9B;&#x652F;&#x4ED8;&#x670D;&#x52A1;&#x7684;&#xFF0C;OceanBase &#x8FD9;&#x6B21;&#x662F;&#x4F7F;&#x7528;&#x4E86; OpenResty &#x4F5C;&#x4E3A; WAS &#x4F9B;&#x5E94;&#x5546;&#x3002;&#x800C; RTE &#x5219;&#x4E00;&#x822C;&#x7531;&#x5404;&#x4E2A;&#x53C2;&#x6D4B;&#x5382;&#x5546;&#x81EA;&#x884C;&#x6839;&#x636E;&#x6807;&#x51C6;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6240;&#x6709;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x5BA1;&#x8BA1;&#x7684;&#x4E25;&#x683C;&#x5BA1;&#x8BA1;&#xFF0C;OceanBase &#x8FD9;&#x6B21;&#x5B8C;&#x6574;&#x7684;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x6574;&#x5957;&#x5B8C;&#x5168;&#x5408;&#x89C4;&#x7684; RTE&#xFF0C;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x4E2D;&#x90E8;&#x7F72;&#x3002;&#x8981;&#x77E5;&#x9053;&#x5728;&#x5B9E;&#x9645;&#x7684; TPC-C &#x6D4B;&#x8BD5;&#x6D41;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x53EA;&#x662F;&#x5BF9; DB &#x7AEF;&#x80FD;&#x529B;&#x7684;&#x8003;&#x9A8C;&#xFF0C;RTE &#x7AEF;&#x540C;&#x6837;&#x5B58;&#x5728;&#x6781;&#x5927;&#x7684;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x548C;&#x538B;&#x529B;&#x3002;&#x4EE5;&#x8FD9;&#x6B21; 6088w tpmC &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5171;&#x5728; 64 &#x53F0; 64c128G &#x7684;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x4E86; 960 &#x4E2A; RTE &#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6765;&#x6A21;&#x62DF;&#x603B;&#x8BA1; 47942400 &#x4E2A;&#x7528;&#x6237; terminal&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x57FA;&#x4E8E;&#x8FD9;&#x4E48;&#x591A; RTE &#x7EDF;&#x8BA1;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x6301;&#x4E45;&#x5316;&#x5BA1;&#x8BA1;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x867D;&#x7136;&#x53EA;&#x662F;&#x6D4B;&#x8BD5;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4F46; RTE &#x7684;&#x4E2D;&#x540C;&#x6837;&#x6709;&#x5927;&#x91CF;&#x7684;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6700;&#x540E;&#x6D4B;&#x8BD5;&#x5931;&#x8D25;&#x7684;&#x5C0F;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x4E0D;&#x5230;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x90FD;&#x56E0;&#x4E3A;&#x7528;&#x4E86; web &#x7AEF;&#x6A21;&#x62DF;&#x7EC8;&#x7AEF;&#x540E;&#x9700;&#x8981;&#x589E;&#x52A0;&#x7684; 100 &#x6BEB;&#x79D2; rt&#xFF0C;&#x53C8;&#x6BD4;&#x5982;&#x4E3A;&#x4E86;&#x6A21;&#x62DF;&#x7528;&#x6237;&#x7EC8;&#x7AEF;&#x8F93;&#x51FA;&#x663E;&#x793A;&#x7684; 100 &#x6BEB;&#x79D2;&#x5EF6;&#x65F6;&#x3002;</p>
<h2 id="&#x6D4B;&#x8BD5;&#x89C4;&#x5212;">&#x6D4B;&#x8BD5;&#x89C4;&#x5212;</h2>
<p>TPC-C &#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5B83;&#x5F88;&#x79D1;&#x5B66;&#x5E76;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x5F3A;&#x5236;&#x7684;&#x8F6F;&#x786C;&#x4EF6;&#x914D;&#x7F6E;&#xFF0C;&#x53EA;&#x662F;&#x7ED9;&#x51FA;&#x6D4B;&#x8BD5;&#x89C4;&#x8303;&#x548C;&#x5404;&#x79CD;&#x5BA1;&#x8BA1;&#x68C0;&#x67E5;&#x9650;&#x5236;&#x6807;&#x51C6;&#xFF0C;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x6027;&#x5145;&#x5206;&#x8C03;&#x4F18;&#x6765;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x597D;&#x7684;&#x6027;&#x80FD;&#x6216;&#x6027;&#x4EF7;&#x6BD4;&#x3002;&#x4F46;&#x8FD9;&#x540C;&#x65F6;&#x4E5F;&#x5BF9;&#x6240;&#x6709;&#x53C2;&#x6D4B;&#x5382;&#x5546;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x96BE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x5BF9;&#x5DF2;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5408;&#x7406;&#x89C4;&#x5212;&#x6765;&#x4FDD;&#x8BC1;&#x987A;&#x5229;&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x5BF9; TPC-C &#x699C;&#x5355;&#x7684;&#x51B2;&#x51FB;&#x3002;</p>
<p>1.&#x786C;&#x4EF6;&#x9009;&#x578B;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x4EC5;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x9009;&#x578B;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5BF9; RTE &#x4EE5;&#x53CA; WAS &#x670D;&#x52A1;&#x5668;&#x9009;&#x578B;&#x3002;&#x8FD9;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x5148;&#x671F;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#x548C;&#x8C03;&#x4F18;&#xFF0C;&#x6765;&#x6478;&#x51FA;&#x5728;&#x4FDD;&#x8BC1;&#x6027;&#x4EF7;&#x6BD4;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x662F;&#x591A;&#x5C11;&#x521A;&#x597D;&#x3002;&#x8FD9;&#x6B21; OceanBase &#x6D4B;&#x8BD5;&#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#x5168;&#x90E8;&#x4F7F;&#x7528;&#x4E86;&#x4E91;&#x5316;&#x8D44;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x5173;&#x6CE8;&#x6700;&#x5E95;&#x5C42;&#x673A;&#x623F;&#x3001;&#x673A;&#x67DC;&#x3001;&#x5E03;&#x7EBF;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5FEB;&#x901F;&#x7684;&#x89C4;&#x683C;&#x8C03;&#x6574;&#x6765;&#x62FF;&#x5230;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x673A;&#x578B;&#x3002;</p>
<p>2.&#x53C2;&#x6570;&#x9009;&#x62E9;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x5178;&#x578B;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x8981;&#x8DD1;&#x591A;&#x5C11;&#x4E2A; Warehouse&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x627F;&#x8F7D;&#x591A;&#x5C11; Warehouse&#x3002;TPC-C &#x6807;&#x51C6;&#x4E3A;&#x4E86;&#x5C3D;&#x53EF;&#x80FD;&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;&#x901A;&#x8FC7;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x9650;&#x5B9A;&#x4E0D;&#x540C;&#x7684; think time &#x548C; keying time &#x4FDD;&#x8BC1;&#x4E86;&#x4E00;&#x4E2A; warehouse &#x7684;&#x6570;&#x636E;&#x6700;&#x591A;&#x80FD;&#x591F;&#x63D0;&#x4F9B; 12.86tpmC &#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x60F3;&#x8981;&#x62FF;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x6210;&#x7EE9;&#x5C31;&#x5FC5;&#x987B;&#x88C5;&#x8F7D;&#x66F4;&#x591A;&#x7684; warehouse&#xFF0C;&#x4F46;&#x662F;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5355;&#x673A;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x53C8;&#x6709;&#x9884;&#x8BA1; 80%&#xFF08;&#x7ECF;&#x9A8C;&#x503C;&#xFF09;&#x9700;&#x8981;&#x9884;&#x7559;&#x7ED9; 60 &#x5929;&#x589E;&#x91CF;&#x5B58;&#x50A8;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x67B6;&#x6784;&#x4E0B;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x8BA9;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x8DD1;&#x6EE1;&#x53C8;&#x80FD;&#x5145;&#x5206;&#x5229;&#x7528;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684; CPU&#x3001;&#x5185;&#x5B58;&#x3001;IO &#x80FD;&#x529B;&#x3001;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x8D44;&#x6E90;&#x6700;&#x5927;&#x5316;&#x5229;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x524D;&#x540E;&#x8C03;&#x6574;&#x4F18;&#x5316;&#x4E86;&#x8FD1;&#x4E00;&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="&#x6027;&#x80FD;&#x538B;&#x6D4B;">&#x6027;&#x80FD;&#x538B;&#x6D4B;</h2>
<p>&#x6700;&#x53D7;&#x5173;&#x6CE8;&#x7684;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x90E8;&#x5206;&#x5728; TPC-C &#x6807;&#x51C6;&#x4E2D;&#x89C4;&#x5B9A;&#x4E86;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x72B6;&#x6001;&#xFF1A;
1.Ramp-up&#xFF0C;&#x6807;&#x51C6;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x7684;&#x9884;&#x70ED;&#x6765;&#x8FBE;&#x5230;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F; ramp-up &#x9636;&#x6BB5;&#x7684;&#x6240;&#x6709;&#x914D;&#x7F6E;&#x5FC5;&#x987B;&#x548C;&#x6700;&#x7EC8;&#x62A5;&#x544A;&#x914D;&#x7F6E;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<p>2.Steady state&#xFF0C;&#x4FDD;&#x8BC1; ACID &#x53CA;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x80FD;&#x591F;&#x4EE5;&#x6700;&#x7EC8;&#x62A5;&#x544A; tpmC &#x503C;&#x5728;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x65E0;&#x4EFB;&#x4F55;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x524D;&#x63D0;&#x4E0B;&#x4FDD;&#x6301;&#x8FD0;&#x884C; 8 &#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#xFF0C;&#x6BCF;&#x9694;&#x534A;&#x5C0F;&#x65F6;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x6B21; checkpoint&#x3002;</p>
<p>3.Measurement Interval&#xFF0C;&#x6807;&#x51C6;&#x89C4;&#x5B9A;&#x4E86;&#x9700;&#x8981;&#x80FD;&#x591F;&#x652F;&#x6301; 8 &#x5C0F;&#x65F6;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x6027;&#x80FD;&#x91C7;&#x96C6;&#x9636;&#x6BB5;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x8BBE;&#x7F6E; 2 &#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x8FD8;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x7D2F;&#x8BA1; tpmC &#x6CE2;&#x52A8;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7; 2%&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x81F3;&#x5C11; 4 &#x4E2A;&#x4EE5;&#x4E0A;&#x7684; checkpoint&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4E4B;&#x524D;&#x4E00;&#x822C;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x4E00;&#x822C;&#x662F;&#x4EE5;&#x4E0B;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x9884;&#x70ED;&#x5230;&#x8FBE;&#x7A33;&#x6001;&#xFF0C;&#x7B49;&#x5F85;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5E76;&#x5B8C;&#x6210;&#x4E00;&#x4E2A; checkpoint &#x540E;&#x5F00;&#x59CB;&#x8FDB;&#x5165; 2 &#x5C0F;&#x65F6;&#x7684;&#x6027;&#x80FD;&#x91C7;&#x96C6;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x800C; OceanBase &#x8FD9;&#x6B21;&#x662F;&#x4F7F;&#x7528;&#x4E86; TPC-C &#x6D4B;&#x8BD5;&#x8FC4;&#x4ECA;&#x4EE5;&#x6765;&#x6700;&#x4E25;&#x82DB;&#x7684;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x6765;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x4E86; 10 &#x5206;&#x949F;&#x8FDB;&#x884C;&#x9884;&#x70ED;&#xFF0C;&#x7136;&#x540E;&#x5728; 6088w tpmC &#x7A33;&#x6001;&#x4FDD;&#x6301;&#x8FD0;&#x884C; 25 &#x5206;&#x949F;&#x5E76;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x70B9;&#xFF0C;&#x518D;&#x7EE7;&#x7EED;&#x8DD1;&#x4E86;&#x5B8C;&#x6574;&#x7684; 8 &#x5C0F;&#x65F6;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x91C7;&#x96C6;&#x9636;&#x6BB5;&#xFF0C;&#x603B;&#x8017;&#x65F6;&#x8D85;&#x8FC7; 8 &#x4E2A;&#x534A;&#x5C0F;&#x65F6;&#xFF0C;&#x4E2D;&#x95F4;&#x6027;&#x80FD;&#x6700;&#x5927;&#x6CE2;&#x52A8;&#x4E0D;&#x5230; 0.5%&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4E5F;&#x8BA9;&#x5BA1;&#x8BA1;&#x5458;&#x5F02;&#x5E38;&#x5174;&#x594B;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x524D;&#x540E;&#xFF0C;&#x5BA1;&#x8BA1;&#x5458;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x53CA;&#x4E8B;&#x52A1;&#x968F;&#x673A;&#x5206;&#x5E03;&#x68C0;&#x67E5;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x6765;&#x5C31;&#x662F;&#x5927;&#x91CF;&#x5168;&#x8868;&#x626B;&#x63CF;&#x548C;&#x7EDF;&#x8BA1; sql&#xFF0C;&#x6700;&#x5927;&#x7684;&#x4E00;&#x6761; sql &#x9700;&#x8981;&#x8BBF;&#x95EE;&#x8D85;&#x8FC7;&#x4E07;&#x4EBF;&#x884C;&#x7684; order_line &#x8868;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x7B97;&#x662F; TPC-C &#x91CC;&#x7684;&#x201C;TPC-H &#x6D4B;&#x8BD5;&#x201D;&#x3002;&#x73B0;&#x573A;&#x5BA1;&#x8BA1;&#x7B2C;&#x4E00;&#x6B21;&#x9047;&#x5230;&#x8FD9;&#x4E9B; sql &#x65F6;&#x6211;&#x4EEC;&#x4E5F;&#x5927;&#x91CF;&#x7684;&#x51FA;&#x73B0; sql &#x6267;&#x884C;&#x8D85;&#x65F6;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x540E;&#x7EED;&#x57FA;&#x4E8E; OceanBase2.2 &#x7248;&#x672C;&#x6700;&#x65B0;&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#x6846;&#x67B6;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x5F88;&#x5FEB;&#x641E;&#x5B9A;&#x4E86;&#x8FD9;&#x4E9B;&#x5927; sql&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x987A;&#x5229;&#x5B8C;&#x6210; TPC-C &#x6D4B;&#x8BD5;&#x5E76;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x504F;&#x79D1;&#x751F;&#xFF0C;&#x4FDD;&#x6301;&#x81EA;&#x8EAB;&#x6CA1;&#x6709;&#x77ED;&#x677F;&#x624D;&#x662F;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x901A;&#x7528;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4ECE;&#x8FD9;&#x70B9;&#x4E0A;&#x8BF4; Oracle &#x4ECD;&#x662F; OceanBase &#x5B66;&#x4E60;&#x7684;&#x699C;&#x6837;&#x3002;</p>
<h2 id="acid">ACID</h2>
<p>1.A &#x6D4B;&#x8BD5;&#xFF0C;&#x901A;&#x8FC7;&#x63D0;&#x4EA4;&#x548C;&#x56DE;&#x6EDA; payment &#x4E8B;&#x52A1;&#x6765;&#x786E;&#x8BA4;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x539F;&#x5B50;&#x6027;&#x652F;&#x6301;&#xFF0C;&#x548C; I &#x6D4B;&#x8BD5;&#x4E00;&#x6837;&#xFF0C;OceanBase &#x7684; A &#x6D4B;&#x8BD5;&#x8DD1;&#x4E86;&#x4E24;&#x904D;&#xFF0C;&#x5206;&#x522B;&#x5E94;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x548C;&#x672C;&#x5730;&#x4E8B;&#x52A1;&#x3002;</p>
<p>2.C &#x6D4B;&#x8BD5;&#xFF0C;&#x6807;&#x51C6;&#x91CC;&#x7684; C &#x6D4B;&#x8BD5;&#x4E00;&#x5171;&#x5305;&#x542B; 12 &#x4E2A; case&#xFF0C;&#x524D;&#x56DB;&#x4E2A;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x5B8C;&#x6210;&#x9A8C;&#x8BC1;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A; case &#x5176;&#x5B9E;&#x90FD;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5927; sql&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x6765;&#x8BF4;&#x91CD;&#x70B9;&#x662F;&#x9700;&#x8981;&#x59CB;&#x7EC8;&#x4FDD;&#x8BC1;&#x5168;&#x5C40;&#x4E00;&#x81F4;&#x3002;</p>
<p>3.I &#x6D4B;&#x8BD5;&#xFF0C;&#x6807;&#x51C6;&#x8981;&#x6C42; TPC-C &#x6A21;&#x578B;&#x91CC; 5 &#x4E2A;&#x4E8B;&#x52A1;&#x9664;&#x4E86; StockLevel &#x4E8B;&#x52A1;&#x90FD;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x6700;&#x9AD8;&#x7684;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5E76;&#x6784;&#x9020;&#x4E86; 9 &#x4E2A; case &#x6765;&#x9A8C;&#x8BC1;&#x9694;&#x79BB;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x8981;&#x6C42;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x5E78; OceanBase &#x5728; 2.x &#x7248;&#x672C;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x5168;&#x5C40;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6240;&#x4EE5;&#x7684; I &#x6D4B;&#x8BD5;&#x90FD;&#x5728;&#x5BA1;&#x8BA1;&#x5458;&#x7684;&#x7279;&#x522B;&#x8981;&#x6C42;&#x4E0B;&#x8DD1;&#x5B8C;&#x4E86;&#x5168;&#x672C;&#x5730;&#x548C;&#x5168;&#x5206;&#x5E03;&#x5F0F;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x4E24;&#x8F6E;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD9;&#x4E5F;&#x5E94;&#x8BE5;&#x662F; TPC-C &#x6D4B;&#x8BD5;&#x4E2D;&#x9996;&#x6B21;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x9700;&#x8981;&#x505A;&#x4E24;&#x8F6E; I &#x6D4B;&#x8BD5;&#x8DD1; 18 &#x4E2A; case &#x7684;&#xFF0C;&#x4E5F;&#x8BB8;&#x5728;&#x4E0D;&#x4E45;&#x540E; TPC-C &#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x4E5F;&#x4F1A;&#x56E0;&#x4E3A; OceanBase &#x7684;&#x8FD9;&#x6B21;&#x6D4B;&#x8BD5;&#x800C;&#x5E26;&#x6765;&#x9488;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x76F8;&#x5173;&#x66F4;&#x65B0;&#x3002;</p>
<p>4.D &#x6D4B;&#x8BD5;&#xFF0C;OceanBase &#x5728;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x5176;&#x5B9E;&#x76F8;&#x5BF9;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x662F;&#x6709;&#x8F83;&#x5927;&#x5929;&#x751F;&#x4F18;&#x52BF;&#x7684;&#xFF0C;OceanBase &#x6BCF;&#x4E2A; Warehouse &#x6570;&#x636E;&#x6709;&#x4E24;&#x4EFD;&#x6570;&#x636E;&#x4E09;&#x4EFD;&#x65E5;&#x5FD7;&#xFF0C;&#x901A;&#x8FC7; paxos &#x5F3A;&#x540C;&#x6B65;&#xFF0C;&#x4FDD;&#x8BC1; RPO=0 &#x7684;&#x524D;&#x63D0;&#x4E0B;&#x53EA;&#x6709;&#x79D2;&#x7EA7; RTO&#x3002;&#x9762;&#x5BF9; D &#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x4E2D;&#x6700;&#x4E25;&#x683C;&#x7684;&#x4E00;&#x9879;-&#x90E8;&#x5206;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x6C38;&#x4E45;&#x6545;&#x969C;&#xFF0C;OceanBase &#x8FD8;&#x4F7F;&#x7528;&#x4E86;&#x6700;&#x4E25;&#x82DB;&#x7684;&#x6D4B;&#x8BD5;&#x573A;&#x666F;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x8D85;&#x51FA;&#x6807;&#x51C6;&#x8981;&#x6C42;&#x7684;&#x5168;&#x91CF; 6000W tpmC &#x538B;&#x529B;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5F3A;&#x884C;&#x9500;&#x6BC1;&#x4E86;&#x4E00;&#x4E2A;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#xFF0C;&#x6574;&#x4F53; tpmC &#x5728;&#x4E24;&#x5206;&#x949F;&#x5185;&#x6062;&#x590D;&#x5230; 6000w &#x5E76;&#x6301;&#x7EED;&#x8DD1;&#x5230;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#x7ED3;&#x675F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8868;&#x73B0;&#x90FD;&#x662F;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7; TPC-C &#x89C4;&#x8303;&#x8981;&#x6C42;&#x7684;&#xFF0C;&#x76F8;&#x6BD4;&#x8F83;&#x800C;&#x8A00;&#x5176;&#x5B83;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x57FA;&#x672C;&#x9762;&#x5BF9;&#x6709;&#x65E5;&#x5FD7;&#x7684;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x6545;&#x969C; D &#x6D4B;&#x8BD5;&#x573A;&#x666F;&#x90FD;&#x662F;&#x4F9D;&#x8D56;&#x78C1;&#x76D8; RAID &#x6765;&#x6062;&#x590D;&#xFF0C;OceanBase &#x5E94;&#x8BE5;&#x7B97;&#x662F;&#x9996;&#x4E2A;&#x6CA1;&#x6709; raid &#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x6570;&#x636E;&#x5E93;&#x81EA;&#x8EAB;&#x6062;&#x590D;&#x673A;&#x5236;&#x5B8C;&#x6210;&#x5168;&#x90E8; D &#x6D4B;&#x8BD5;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x4E86;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x5728; D &#x6D4B;&#x8BD5;&#x4E2D;&#x662F;&#x8FDE;&#x7EED;&#x6740;&#x6389;&#x4E86;&#x4E24;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#xFF0C;&#x9996;&#x5148;&#x6740;&#x6389;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x8282;&#x70B9;&#xFF0C;&#x7B49;&#x5F85; tpmC &#x6062;&#x590D;&#x4E14;&#x7A33;&#x5B9A; 5 &#x5206;&#x949F;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x6740;&#x6389;&#x4E86; rootserver leader &#x8282;&#x70B9;&#xFF0C;tpmC &#x4ECD;&#x7136;&#x5FEB;&#x901F;&#x6062;&#x590D;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x4ECB;&#x7ECD;&#xFF1A;
&#x66F9;&#x6656;&#xFF0C;&#x73B0;&#x4EFB;&#x8682;&#x8681;&#x91D1;&#x670D; OceanBase &#x56E2;&#x961F;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#xFF0C;2017 &#x5E74;&#x52A0;&#x5165; OceanBase &#x56E2;&#x961F;&#xFF0C;&#x73B0;&#x4ECE;&#x4E8B;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;&#x516C;&#x4F17;&#x53F7;&#x8682;&#x8681;&#x91D1;&#x670D;&#x79D1;&#x6280;&#xFF08;ID&#xFF1A;Ant-Techfin&#xFF09;&#x3002;</p>
<p>&#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF1A;
&#x200B;<a href="https://mp.weixin.qq.com/s/zc1sO1eVRiFk8gUipZbjRA" target="_blank">https://mp.weixin.qq.com/s/zc1sO1eVRiFk8gUipZbjRA</a> </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1-基准测试介绍.html" class="navigation navigation-prev " aria-label="Previous page: 1-基准测试介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3-基准测试之SQL优化.html" class="navigation navigation-next " aria-label="Next page: 3-基准测试之SQL优化">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2-OceanBase如何做TPCC测试","level":"1.5.3.2","depth":3,"next":{"title":"3-基准测试之SQL优化","level":"1.5.3.3","depth":3,"path":"src/04-tpcc/3-基准测试之SQL优化.md","ref":"src/04-tpcc/3-基准测试之SQL优化.md","articles":[]},"previous":{"title":"1-基准测试介绍","level":"1.5.3.1","depth":3,"path":"src/04-tpcc/1-基准测试介绍.md","ref":"src/04-tpcc/1-基准测试介绍.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters","livereload"],"pluginsConfig":{"expandable-chapters":{},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","mtime":"2022-11-29T07:33:25.982Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-11-29T07:51:37.202Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

