
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3-基准测试之SQL优化 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4-基准测试之事务引擎的挑战.html" />
    
    
    <link rel="prev" href="2-OceanBase如何做TPCC测试.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    01-操作系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../01-操作系统/linux.html">
            
                <a href="../01-操作系统/linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../01-操作系统/windows.html">
            
                <a href="../01-操作系统/windows.html">
            
                    
                    windows
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    02-数据结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../02-数据结构/list.html">
            
                <a href="../02-数据结构/list.html">
            
                    
                    list
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    03-计算机网络
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../03-计算机网络/tcp.html">
            
                <a href="../03-计算机网络/tcp.html">
            
                    
                    tcp
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    04-tpcc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="1-基准测试介绍.html">
            
                <a href="1-基准测试介绍.html">
            
                    
                    1-基准测试介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="2-OceanBase如何做TPCC测试.html">
            
                <a href="2-OceanBase如何做TPCC测试.html">
            
                    
                    2-OceanBase如何做TPCC测试
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.3" data-path="3-基准测试之SQL优化.html">
            
                <a href="3-基准测试之SQL优化.html">
            
                    
                    3-基准测试之SQL优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="4-基准测试之事务引擎的挑战.html">
            
                <a href="4-基准测试之事务引擎的挑战.html">
            
                    
                    4-基准测试之事务引擎的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="5-基准测试之存储优化.html">
            
                <a href="5-基准测试之存储优化.html">
            
                    
                    5-基准测试之存储优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="6-基准测试之链路层优化.html">
            
                <a href="6-基准测试之链路层优化.html">
            
                    
                    6-基准测试之链路层优化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    05-misc
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../misc/gitbook安装.html">
            
                <a href="../misc/gitbook安装.html">
            
                    
                    gitbook安装
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >3-基准测试之SQL优化</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E4B;sql&#x4F18;&#x5316;">3-&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E4B;SQL&#x4F18;&#x5316;</h1>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x9648;&#x840C;&#x840C;&#x3001;&#x6F58;&#x6BC5; 2019 &#x5E74; 10 &#x6708; 21 &#x65E5;</p>
<p>TPC-C &#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4E25;&#x82DB;&#x7684;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x6A21;&#x578B;&#xFF0C;&#x8003;&#x9A8C;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x5907;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5168;&#x94FE;&#x8DEF;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728; TPC-C &#x7684;&#x699C;&#x5355;&#x524D;&#x5217;&#xFF0C;&#x51FA;&#x73B0;&#x7684;&#x6C38;&#x8FDC;&#x53EA;&#x662F;&#x5927;&#x5BB6;&#x719F;&#x77E5;&#x7684;&#x90A3;&#x51E0;&#x5BB6;&#x5728;&#x4E1A;&#x754C;&#x6709;&#x7740;&#x51E0;&#x5341;&#x5E74;&#x79EF;&#x7D2F;&#x3001;&#x4ECE;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7406;&#x8BBA;&#x5F00;&#x59CB;&#x53D1;&#x5C55;&#x5C31;&#x5DEE;&#x4E0D;&#x591A;&#x540C;&#x6B65;&#x51FA;&#x73B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x516C;&#x53F8;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E3A;&#x60A8;&#x5206;&#x6790;&#x5728; TPC-C &#x6D4B;&#x8BD5;&#x4E2D; OceanBase &#x6570;&#x636E;&#x5E93;&#x7684; SQL &#x6A21;&#x5757;&#x5177;&#x4F53;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x6311;&#x6218;&#x3001;&#x505A;&#x51FA;&#x4E86;&#x54EA;&#x4E9B;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x5BF9; TPC-C &#x6709;&#x6240;&#x4E86;&#x89E3;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;TPC-C &#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684; OLTP (On-Line Transaction Processing) &#x573A;&#x666F;&#x6D4B;&#x8BD5;&#xFF0C;&#x8003;&#x5BDF;&#x7684;&#x662F;&#x6570;&#x636E;&#x5E93;&#x5728;&#x9AD8;&#x5E76;&#x53D1;&#x538B;&#x529B;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#x4EE5; tpmC(transaction per minute&#xFF0C;&#x4E5F;&#x5373;&#x6BCF;&#x5206;&#x949F;&#x7CFB;&#x7EDF;&#x5904;&#x7406; TPC-C &#x6A21;&#x578B;&#x4E2D;&#x7684; new order &#x4E8B;&#x52A1;&#x7684;&#x6570;&#x91CF;)&#x548C;&#x5E73;&#x5747;&#x5230;&#x6BCF; tpmC &#x7684;&#x7CFB;&#x7EDF;&#x6210;&#x672C;&#x4F5C;&#x4E3A;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x3002;&#x5728; OLTP &#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x6781;&#x77ED;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5404;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x5728;&#x8FDB;&#x884C; TPC-C &#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x5C3D;&#x4E00;&#x5207;&#x53EF;&#x80FD;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#x538B;&#x7F29;&#x5230;&#x6700;&#x77ED;&#xFF0C;&#x4E0D;&#x5938;&#x5F20;&#x7684;&#x8BF4;&#xFF0C;&#x5728; TPC-C &#x7684;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x64CD;&#x4F5C;&#x7684;&#x4F18;&#x5316;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x7EC6;&#x5316;&#x5230; CPU &#x6307;&#x4EE4;&#x7EA7;&#x3002;</p>
<p>&#x5728;&#x8FDB;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x9898;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x8C08;&#x8C08; TPC-C &#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E94;&#x79CD;&#x4E8B;&#x52A1;&#xFF0C;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x3001;&#x8BA2;&#x5355;&#x652F;&#x4ED8;&#x3001;&#x8BA2;&#x5355;&#x67E5;&#x8BE2;&#x3001;&#x8BA2;&#x5355;&#x53D1;&#x8D27;&#x4EE5;&#x53CA;&#x5E93;&#x5B58;&#x67E5;&#x8BE2;&#xFF0C;&#x8FD9;&#x4E94;&#x79CD;&#x4E8B;&#x52A1;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x6BD4;&#x4F8B;&#x53D1;&#x751F;&#xFF0C;&#x6D4B;&#x8BD5;&#x6700;&#x7EC8;&#x8861;&#x91CF;&#x7684;&#x662F;&#x6BCF;&#x5206;&#x949F;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x4E2A;&#x6570;&#x3002;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x5B9A;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x5173;&#x8054;&#x7684;&#x82E5;&#x5E72;&#x6761; SQL &#x8BED;&#x53E5;&#x7EC4;&#x6210;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x79F0;&#x4E3A;&#x201C;&#x539F;&#x5B50;&#x6027;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; ACID &#x4E2D;&#x7684;&#x201C;A&#x201D;&#x3002;&#x90A3;&#x4E48; TPC-C &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x8017;&#x65F6;&#x5927;&#x7EA6;&#x662F;&#x591A;&#x4E45;&#x5462;&#xFF1F;&#x770B;&#x4E00;&#x4E0B;&#x62A5;&#x544A;&#x5C31;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#x2014;&#x2014;&#x53EA;&#x6709;&#x5341;&#x51E0;&#x4E2A;&#x6BEB;&#x79D2;&#x3002;&#x8003;&#x8651;&#x5230;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7531;&#x591A;&#x6761; SQL &#x6784;&#x6210;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E00;&#x6761; SQL &#x7684;&#x5E73;&#x5747;&#x8017;&#x65F6;&#x90FD;&#x4E0D;&#x5230; 1 &#x6BEB;&#x79D2;&#xFF01;</p>
<p>&#x5728; C/S&#xFF08;client-server&#xFF09;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E00;&#x6761; SQL &#x8BED;&#x53E5;&#x4ECE;&#x53D1;&#x8D77;&#x5230;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x9700;&#x8981;&#x7ECF;&#x5386;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x8F93;&#x5165;&#x3001;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x3001;SQL &#x4F18;&#x5316;&#x3001;&#x6267;&#x884C;&#x3001;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;&#x800C;&#x5177;&#x4F53;&#x6BCF;&#x4E00;&#x6761; SQL &#x7684;&#x6267;&#x884C;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x9700;&#x8981;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x662F;&#x975E;&#x5E38;&#x77ED;&#x6682;&#x7684;&#xFF0C;&#x4ECE;&#x6574;&#x4E2A;&#x94FE;&#x8DEF;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x82B1;&#x8D39;&#x5728;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9020;&#x6210;&#x8D44;&#x6E90;&#x7684;&#x6D6A;&#x8D39;&#x548C;&#x8017;&#x65F6;&#x7684;&#x589E;&#x52A0;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;">&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;</h2>
<p>&#x6240;&#x8C13;&#x201C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x201D;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x903B;&#x8F91;&#x5C01;&#x88C5;&#x4E3A;&#x4E00;&#x4E2A;&#x53EF;&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#xFF08;procedure&#xFF09;&#x5B58;&#x653E;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E76;&#x968F;&#x65F6;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5C06;&#x672C;&#x6765;&#x9700;&#x8981;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x4EA4;&#x4E92;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x4EA4;&#x4E92;&#x5B8C;&#x6210;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x4E2D;&#x95F4;&#x7F51;&#x7EDC;&#x7684;&#x4F20;&#x8F93;&#x548C;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 1&#xFF09;&#x3002;&#x5047;&#x5982;&#x4E00;&#x6761;&#x4E8B;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x5F00;&#x9500;&#x5E73;&#x5747;&#x662F; 30%&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; 30% &#x7684; CPU &#x90FD;&#x82B1;&#x5728;&#x4E86;&#x7F51;&#x7EDC;&#x7684;&#x6536;&#x53D1;&#x548C;&#x89E3;&#x6790;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x5728; 6 &#x5343;&#x4E07;&#x89C4;&#x6A21; tpmC &#x6D4B;&#x8BD5;&#x4E2D;&#x8282;&#x7701;&#x4E0B;&#x6765; 30% &#x7684; CPU &#x8D44;&#x6E90;&#x6362;&#x7B97;&#x6210;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x662F;&#x60CA;&#x4EBA;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x8FD8;&#x53EF;&#x4EE5;&#x5E26;&#x6765;&#x4E8B;&#x52A1;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x4E0B;&#x964D;&#xFF0C;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x5185;&#x6838;&#x4E2D;&#x4E8B;&#x52A1;&#x9501;&#x7684;&#x4E34;&#x754C;&#x533A;&#x7F29;&#x77ED;&#xFF0C;&#x95F4;&#x63A5;&#x7684;&#x63D0;&#x5347;&#x4E86;&#x7CFB;&#x7EDF; CPU &#x5229;&#x7528;&#x7387;&#xFF0C;&#x6574;&#x4E2A;&#x541E;&#x5410;&#x91CF;&#x4E5F;&#x968F;&#x4E4B;&#x63D0;&#x9AD8;&#x3002;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5728;&#x7F29;&#x77ED;&#x5E94;&#x7528;&#x7AEF;&#x7684;&#x7B49;&#x5F85;&#x8017;&#x65F6;&#x4E0A;&#x540C;&#x6837;&#x6709;&#x5F88;&#x5927;&#x4F5C;&#x7528;&#x3002;</p>
<div align="center">
<img src="tpcc3-01.png" width="80%" height="80%">
</div>&#x200B;
&#x56FE; 1 &#x4F20;&#x7EDF;&#x7684; C/S &#x6A21;&#x578B;&#x4E0E;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#x5BF9;&#x6BD4;

&#x5728; TPC-C &#x4E2D;&#xFF0C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x63D0;&#x5347;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;OceanBase 2.2 &#x7248;&#x672C;&#x4E0D;&#x4EC5;&#x5168;&#x9762;&#x652F;&#x6301;&#x4E86;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x6781;&#x81F4;&#x7684;&#x4F18;&#x5316;&#x3002;

## &#x7F16;&#x8BD1;&#x6267;&#x884C; ##
&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x673A;&#x5668;&#x7801;&#x624D;&#x80FD;&#x591F;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x201C;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x201D;&#x548C;&#x201C;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x201D;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x76F8;&#x6BD4;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x6709;&#x4EE3;&#x7801;&#x4F18;&#x5316;&#x5145;&#x5206;&#x3001;&#x6267;&#x884C;&#x6548;&#x7387;&#x9AD8;&#x7B49;&#x7279;&#x70B9;&#x3002;OceanBase &#x5229;&#x7528;&#x8FD1;&#x4E24;&#x5E74;&#x9010;&#x6E10;&#x6210;&#x719F;&#x7684; LLVM &#x7F16;&#x8BD1;&#x5668;&#x6846;&#x67B6;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#xFF08;Just-in-Time Compilation&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x5C06;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7FFB;&#x8BD1;&#x6210;&#x9AD8;&#x6548;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E0A;&#x83B7;&#x5F97;&#x4E86;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x63D0;&#x5347;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FC7;&#x7A0B;&#x4E2D; LLVM &#x6846;&#x67B6;&#x5C06;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x8F6C;&#x6362;&#x4E3A;&#x4E0E;&#x673A;&#x5668;&#x65E0;&#x5173;&#x7684;&#x4E2D;&#x95F4;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5F97;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E5F;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x83B7;&#x5F97;&#x4E86;&#x8DE8;&#x5E73;&#x53F0;&#x7684;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x80FD;&#x529B;&#xFF0C;LLVM &#x5185;&#x7F6E;&#x7684;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x5728;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6B63;&#x786E;&#x3001;&#x9AD8;&#x6548;&#x7684;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x3002;
## Array Binding ##
&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5728; TPC-C &#x6D4B;&#x8BD5;&#x4E2D;&#x53D1;&#x6325;&#x4E86;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x5BF9; DML &#x8BED;&#x53E5;&#x8FDB;&#x884C;&#x6279;&#x91CF;&#x5904;&#x7406;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5728; Oracle &#x4E2D;&#x8BE5;&#x529F;&#x80FD;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;Array Binding&#x201D;&#x3002;&#x4E00;&#x6761; SQL &#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x4E0A;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x201C;&#x8BA1;&#x5212;&#x751F;&#x6210;&#x201D;&#x548C;&#x201C;&#x6267;&#x884C;&#x201D;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5BF9; SQL &#x7684;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x505A;&#x4E86;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x4F46;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x5728;&#x6574;&#x4E2A;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4ECD;&#x7136;&#x662F;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x90A3;&#x6709;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7701;&#x53BB;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5462;&#xFF1F;&#x5F53;&#x4E00;&#x7EC4; SQL &#x7684;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x800C;&#x53EA;&#x6709;&#x6267;&#x884C;&#x53C2;&#x6570;&#x4E0D;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7279;&#x5B9A;&#x7684;&#x8BED;&#x6CD5;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x6267;&#x884C;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x5904;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6B64;&#x65F6;&#x201C;&#x8BA1;&#x5212;&#x751F;&#x6210;&#x201D;&#x53EA;&#x9700;&#x8981;&#x505A;&#x4E00;&#x6B21;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;Array Binding&#x201D;&#x3002;

&#x5728; Array Binding &#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x9996;&#x5148;&#x627E;&#x5230;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x8BE5;&#x8BA1;&#x5212;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#xFF08;binding&#xFF09;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x4E00;&#x4E2A; C &#x8BED;&#x8A00;&#x7684; for &#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x53CD;&#x590D;&#x8D4B;&#x503C;&#x800C;&#x4E0D;&#x662F;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;Array Binding &#x7684;&#x4F7F;&#x7528;&#x53D7;&#x7528;&#x6237;&#x63A7;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528; FORALL &#x5173;&#x952E;&#x5B57;&#x6765;&#x89E6;&#x53D1;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#xFF0C;&#x5728; TPC-C &#x7684;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x4E86; Array Binding &#x6765;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x6548;&#x679C;&#x975E;&#x5E38;&#x660E;&#x663E;&#x3002;

## Prepared Statement &#x4E0E;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x7F13;&#x5B58; ##
Prepared Statement &#x662F;&#x4E00;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x8BF7;&#x6C42;&#x4EA4;&#x4E92;&#x534F;&#x8BAE;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x7684;&#x4EA4;&#x4E92;&#x6210;&#x672C;&#x3002;OceanBase &#x4E0D;&#x4EC5;&#x652F;&#x6301;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x95F4;&#x4F7F;&#x7528; Prepared Statement, &#x4E5F;&#x652F;&#x6301;&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5F15;&#x64CE;&#x8C03;&#x7528; SQL &#x5F15;&#x64CE;&#x6267;&#x884C;&#x65F6;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x3002;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5728;&#x5BF9; SQL &#x8FDB;&#x884C;&#x4E00;&#x6B21; Prepare &#x64CD;&#x4F5C;&#x5E76;&#x83B7;&#x53D6;&#x552F;&#x4E00; id &#x540E;, &#x540E;&#x7EED;&#x7684;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x4EC5;&#x9700;&#x8981;&#x4F20;&#x5165;&#x8BE5; id &#x548C;&#x5BF9;&#x5E94;&#x7684;&#x53C2;&#x6570;,&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x6216; SQL &#x8BA1;&#x5212;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;&#x8BE5;&#x8FC7;&#x7A0B;&#x76F8;&#x6BD4;&#x4F7F;&#x7528; SQL &#x6587;&#x672C;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x6587;&#x672C;&#x89E3;&#x6790;&#x7684; CPU &#x5F00;&#x9500;&#x3002;

OceanBase &#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x4E86;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x6765;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x53CA; SQL &#x6267;&#x884C;&#x8BA1;&#x5212;, &#x4E0D;&#x540C;&#x53C2;&#x6570;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x548C; SQL &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E00;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5FEB;&#x901F;&#x83B7;&#x53D6;&#x9700;&#x8981;&#x7684;&#x6267;&#x884C;&#x5BF9;&#x8C61;, &#x8017;&#x65F6;&#x4E00;&#x822C;&#x5728;&#x51E0;&#x5341;&#x5FAE;&#x79D2;&#x4EE5;&#x5185;, &#x6709;&#x6548;&#x907F;&#x514D;&#x4E86;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x5E26;&#x6765;&#x7684;&#x6BEB;&#x79D2;&#x7EA7;&#x7684;&#x5EF6;&#x8FDF;&#x548C; CPU &#x6D88;&#x8017;&#x3002;

## &#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE; ##
&#x5728; OLTP &#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x5E94;&#x7528;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EA4;&#x4E92;&#x6B21;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x7684;&#x4F8B;&#x5B50;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x89C6;&#x56FE;&#x901A;&#x5E38;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x89C6;&#x56FE;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5176;&#x83B7;&#x53D6;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x89C6;&#x56FE;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x6BD4;&#x5982;&#x5728; TPC-C &#x7684; new order &#x521B;&#x5EFA;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5F97;&#x5230;&#x5546;&#x54C1;&#x4FE1;&#x606F;&#xFF0C;&#x66F4;&#x65B0;&#x5E93;&#x5B58;&#x5E76;&#x5F97;&#x5230;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x503C;&#x3002;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x6761; SQL &#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#xFF1A;
<div align="center">
<img src="tpcc3-02.png" width="80%" height="80%">
</div>
&#x200B;
&#x4F46;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#xFF1A;
<div align="center">
<img src="tpcc3-03.png" width="80%" height="80%">
</div>

<p>&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x66F4;&#x65B0;&#x5E93;&#x5B58;&#x5E76;&#x5F97;&#x5230;&#x5546;&#x54C1;&#x548C;&#x5E93;&#x5B58;&#x4FE1;&#x606F;&#xFF1A;</p>
<div align="center">
<img src="tpcc3-04.png" width="80%" height="80%">
</div>

<p>&#x8FD9;&#x6837;&#x5C31;&#x7701;&#x53BB;&#x4E86;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x65B0;&#x903B;&#x8F91;&#x66F4;&#x52A0;&#x76F4;&#x89C2;&#x3002;&#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x50CF;&#x666E;&#x901A;&#x8868;&#x4E00;&#x6837;&#x64CD;&#x4F5C;&#x89C6;&#x56FE;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x89C6;&#x56FE;&#x90FD;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#x3002;&#x6BD4;&#x5982;&#x5E26; distinct, group by &#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x5177;&#x4F53;&#x66F4;&#x65B0;&#x54EA;&#x4E9B;&#x884C;&#x8BED;&#x4E49;&#x662F;&#x4E0D;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x5141;&#x8BB8;&#x66F4;&#x65B0;&#x3002;&#x5177;&#x4F53;&#x5230;&#x4E0A;&#x9762;&#x7684; stock_item &#x4E24;&#x8868; join &#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x6240;&#x66F4;&#x65B0;&#x8868;&#x7684; unique key &#x5728; join &#x4E4B;&#x540E;&#x4FDD;&#x6301; unique (key-preserved table)&#xFF0C;&#x5373; item.i_id &#x5FC5;&#x987B;&#x662F;&#x552F;&#x4E00;&#x7684;&#x8FD9;&#x4E2A;&#x524D;&#x63D0;&#x3002;</p>
<p>&#x9700;&#x8981;&#x5F3A;&#x8C03;&#xFF0C;TPC-C &#x89C4;&#x8303;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x7269;&#x5316;&#x89C6;&#x56FE;&#xFF0C;&#x800C;&#x53EF;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x8868;&#x683C;&#x7684;&#x5B58;&#x50A8;&#x5F62;&#x5F0F;&#xFF0C;&#x662F;&#x7B26;&#x5408;&#x89C4;&#x8303;&#x7684;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x56E0;&#x4E3A; TPC-C &#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x201C;&#x771F;&#x5B9E;&#x201D;&#x53CD;&#x5E94;&#x4E00;&#x4E2A; OLTP &#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5F88;&#x591A;&#x4F18;&#x5316;&#x90FD;&#x5177;&#x6709;&#x5E7F;&#x6CDB;&#x7684;&#x9002;&#x7528;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9AD8;&#x5E76;&#x53D1;&#x7684; OLTP &#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684; SQL &#x8BF7;&#x6C42;&#x7684;&#x8017;&#x65F6;&#x662F;&#x975E;&#x5E38;&#x77ED;&#x7684;&#xFF0C;&#x91C7;&#x7528;&#x7EAF;&#x7CB9;&#x7684; C/S &#x4EA4;&#x4E92;&#x6A21;&#x578B;&#x7684;&#x540E;&#x679C;&#x5FC5;&#x7136;&#x4F7F;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x5E94;&#x7528;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9891;&#x7E41;&#x4EA4;&#x4E92;&#x4E2D;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7F13;&#x89E3;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x7684;&#x8017;&#x65F6;&#xFF0C;&#x5E76;&#x4E14;&#x589E;&#x5F3A;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#x7684;&#x514D;&#x75AB;&#x529B;&#xFF0C;&#x8FD9;&#x79CD;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F; OLTP &#x6570;&#x636E;&#x5E93;&#x662F;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x3002;</p>
<p>OceanBase &#x4ECE;&#x521B;&#x7ACB;&#x4F0A;&#x59CB;&#x5C31;&#x575A;&#x6301;&#x8D70;&#x81EA;&#x4E3B;&#x7814;&#x53D1;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x786E;&#x4FDD;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x5185;&#x6838;&#x6709;&#x7740;&#x5B8C;&#x5168;&#x7684;&#x638C;&#x63A7;&#x80FD;&#x529B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6709;&#x5728;&#x4EFB;&#x4F55;&#x573A;&#x666F;&#x4E0B;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x6027;&#x80FD;&#x7684;&#x5E95;&#x6C14;&#x548C;&#x5B9E;&#x529B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5BF9;&#x4EA7;&#x54C1;&#x5F62;&#x6001;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x6709;&#x66F4;&#x6E05;&#x6670;&#x7684;&#x89C4;&#x5212;&#x548C;&#x76EE;&#x6807;&#x3002;&#x5728;&#x8FD9;&#x6B21;&#x7684; TPC-C &#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E86; OceanBase 2.0 &#x7248;&#x672C;&#x5F00;&#x59CB;&#x652F;&#x6301;&#x7684; Oracle &#x517C;&#x5BB9;&#x6A21;&#x5F0F;&#xFF0C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x548C; SQL &#x5168;&#x90E8;&#x4F7F;&#x7528;&#x4E86;&#x517C;&#x5BB9; Oracle &#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x8BED;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x4F18;&#x5316;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x786E;&#x4FDD;&#x4EA7;&#x54C1;&#x8FED;&#x4EE3;&#x53EF;&#x4EE5;&#x6CBF;&#x7740;&#x901A;&#x7528;&#x548C;&#x6B63;&#x89C4;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x3002;&#x4ECE; OceanBase 2.0 &#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;OceanBase &#x5C31;&#x4E0D;&#x65AD;&#x671D;&#x7740; Oracle &#x517C;&#x5BB9;&#x8FD9;&#x4E2A;&#x5927;&#x7684;&#x76EE;&#x6807;&#x524D;&#x8FDB;&#xFF0C;&#x968F;&#x7740; 2.2 &#x7248;&#x672C;&#x652F;&#x6301;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF08;PL/SQL&#xFF09;&#x529F;&#x80FD;&#x7684;&#x5B8C;&#x5584;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x529F;&#x80FD;&#x4E5F;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x8F6E;&#x65B0;&#x7684;&#x8FED;&#x4EE3;&#x3002;&#x6211;&#x4EEC;&#x575A;&#x4FE1;&#x8FD9;&#x6B21;&#x7684; TPC-C &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x4E0D;&#x4EC5;&#x4EC5;&#x89C1;&#x8BC1;&#x4E86; OceanBase &#x7684;&#x6781;&#x81F4;&#x6027;&#x80FD;&#xFF0C;&#x4E5F;&#x5C06;&#x6210;&#x4E3A; OceanBase &#x6570;&#x636E;&#x5E93;&#x8D70;&#x5411;&#x6210;&#x719F;&#x4EA7;&#x54C1;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x8D77;&#x70B9;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<p>&#x9648;&#x840C;&#x840C;&#xFF0C;&#x73B0;&#x4EFB;&#x8682;&#x8681;&#x91D1;&#x670D; OceanBase &#x56E2;&#x961F;&#x8D44;&#x6DF1;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#xFF0C;&#x8D1F;&#x8D23; OceanBase SQL &#x65B9;&#x5411;&#x7684;&#x7814;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;2006 &#x5E74;&#x6BD5;&#x4E1A;&#x4E8E;&#x6E05;&#x534E;&#x5927;&#x5B66;&#xFF0C;2006 &#x5E74;&#x5230; 2008 &#x5E74;&#x5728;&#x6B27;&#x6D32;&#x6838;&#x5B50;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#xFF08;CERN&#xFF09;&#x8D1F;&#x8D23;&#x7F51;&#x683C;&#x8BA1;&#x7B97;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;2009 &#x5E74;&#x5728;&#x7F8E;&#x56FD;&#x5A01;&#x65AF;&#x5EB7;&#x661F;&#x5927;&#x5B66;&#x9EA6;&#x8FEA;&#x900A;&#x5206;&#x6821;&#x83B7;&#x5F97;&#x8BA1;&#x7B97;&#x673A;&#x7855;&#x58EB;&#x5B66;&#x4F4D;&#xFF0C;&#x5148;&#x540E;&#x5728; Oracle&#x3001;&#x534E;&#x4E3A;&#x7F8E;&#x56FD;&#x7814;&#x7A76;&#x6240;&#x4ECE;&#x4E8B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x7814;&#x7A76;&#x3002;</p>
<p>&#x6F58;&#x6BC5;&#xFF0C;&#x73B0;&#x4EFB;&#x8682;&#x8681;&#x91D1;&#x670D; OceanBase &#x56E2;&#x961F;&#x8D44;&#x6DF1;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#xFF0C;&#x8D1F;&#x8D23; OceanBase &#x7684;&#x5E76;&#x884C;&#x67E5;&#x8BE2;&#x548C;&#x65B0;&#x4E00;&#x4EE3; OLAP &#x5F15;&#x64CE;&#x3002;&#x66FE;&#x5C31;&#x804C;&#x4E8E;&#x7F8E;&#x56FD; Oracle &#x516C;&#x53F8;&#xFF0C;&#x8D1F;&#x8D23; Oracle &#x6570;&#x636E;&#x5E93;&#x5E76;&#x884C;&#x67E5;&#x8BE2;&#x7814;&#x53D1;&#x5DE5;&#x4F5C;&#x5E76;&#x6709;&#x591A;&#x9879;&#x4E13;&#x5229;&#x7533;&#x8BF7;&#x3002;</p>
<p>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;&#x516C;&#x4F17;&#x53F7;&#x8682;&#x8681;&#x91D1;&#x670D;&#x79D1;&#x6280;&#xFF08;ID&#xFF1A;Ant-Techfin&#xFF09;&#x3002;</p>
<p>&#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF1A;
&#x200B;<a href="https://mp.weixin.qq.com/s/zLEVB96DtAJi8vqKZfLVFA" target="_blank">https://mp.weixin.qq.com/s/zLEVB96DtAJi8vqKZfLVFA</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2-OceanBase如何做TPCC测试.html" class="navigation navigation-prev " aria-label="Previous page: 2-OceanBase如何做TPCC测试">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4-基准测试之事务引擎的挑战.html" class="navigation navigation-next " aria-label="Next page: 4-基准测试之事务引擎的挑战">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3-基准测试之SQL优化","level":"1.5.3","depth":2,"next":{"title":"4-基准测试之事务引擎的挑战","level":"1.5.4","depth":2,"path":"src/04-tpcc/4-基准测试之事务引擎的挑战.md","ref":"src/04-tpcc/4-基准测试之事务引擎的挑战.md","articles":[]},"previous":{"title":"2-OceanBase如何做TPCC测试","level":"1.5.2","depth":2,"path":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","ref":"src/04-tpcc/2-OceanBase如何做TPCC测试.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/04-tpcc/3-基准测试之SQL优化.md","mtime":"2022-11-26T05:22:54.389Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-11-26T05:32:25.530Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

